{
    "status": 200,
    "profession": [
        {
            "id": 1,
            "code": "webDeveloper",
            "name": "Веб-разработчик (PHP)",
            "competencyCount": 25,
            "courseCount": 8,
            "groups": [
                {
                    "id": 1,
                    "code": "programmingTheory",
                    "name": "Теория программирования",
                    "competencies": [
                        {
                            "id": 1,
                            "code": "functionalProgramming",
                            "name": "Функциональное программирование",
                            "level1": "Владею понятиями алгоритма, именованных переменных и функций. Хорошо знаю базовые алгоритмы: линейный поиск, сортировка и бинарный поиск, обход многомерного массива, векторные и матричные операции",
                            "level2": "Знаю что такое сложные типы данных, рекурсия, лямбда функции, карринг, функции высшего порядка. Знаю о чистоте функций и побочных эффектах. Имею опыт использования замыканий",
                            "level3": "Понятие вычислимости. Знаю о машине Тьюринга, конечных автоматах. Хорошо ориентируюсь в классах вычислительной сложности задач. Знаю, что такое NP-полные задачи, могу привести пример одной из формулировок. Алгоритм NP-перебора",
                            "level4": "Прекрасно понимаю, что такое параллельные алгоритмы (очередь, конвейер), транзакции, мертвая блокировка, состояние гонки. Знаю, что такое семафоры, мьютексы",
                            "competencyGroupId": 1,
                            "group": {
                                "id": 1,
                                "code": "programmingTheory",
                                "name": "Теория программирования"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        },
                        {
                            "id": 2,
                            "code": "oopProgramming",
                            "name": "ОО программирование и проектирование",
                            "level1": "Имею представление о базовых принципах ООП: абстракция, инкапсуляция, наследование, полиморфизм. Знаю об инкапсуляции данных и приватных методов. Знаю о понятиях интерфейса, абстрактного класса. Владею простейшими шаблонами проектирования: одиночка (singleton), фабрика (factory), фасад (fascade), адаптер (adapter)",
                            "level2": "Владею расширением без наследования (композиция, полиморфные классы, шаблонные методы). Владею сериализацией и десериализацией объектов",
                            "level3": "Уверенно владею другими шаблонами проектирования: наблюдатель (observer), посетитель (visitor), стратегия (strategy), реестр (registry). Имею опыт работы с DI-фрейморками. Владею основными принципами объектно-ориентированного программирования и проектирования: SOLID",
                            "level4": "Уверенно знаю, могу применять и подбирать под нужды проекта архитектурные шаблоны: MVC, MVP, MVVM, DDD. Знаю как лучше организовать код по файлам, каталогам, пространствам имен",
                            "competencyGroupId": 1,
                            "group": {
                                "id": 1,
                                "code": "programmingTheory",
                                "name": "Теория программирования"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        },
                        {
                            "id": 3,
                            "code": "codeQuality",
                            "name": "Качество кода",
                            "level1": "Знаю о необходимости уделять внимание качеству кода. Знаю, что заниматься ad hoc разработкой плохо. Понимаю, что необходимо возвращаться к написанным фрагментам кода для их улучшения. Знаю, что нужно уделять больше внимания именованию переменных, функций, объектов, таблиц. Представляю, что нужно переписывать код, чтобы сделать его более понятным и простым",
                            "level2": "Имею представление об основных запахах кода: дублирование кода, мертвый код, операторы switch, стрельба дробью, завистливые функции и пр. Владею некоторыми техниками рефакторинга: извлечение/перемещение метода, класса, удаление посредника, инкапсуляция поля, замена параметров объектом, свертывание иерархии и пр. Периодически применяю эти техники для улучшения кода. Стараюсь придерживаться определенных стилей при написании кода: именование переменных, классов, форматирование",
                            "level3": "Постоянно занимаюсь рефакторингом, имею 7-е чувство на запахи кода. Придерживаюсь правила бойскаута: \\\"Оставь поляну лучше, чем она была до тебя\\\". Пишу код, который можно повторно использовать. Не по наслышке знаком с практиками экстремального программирования, применяю их на практике",
                            "level4": "Постоянно применяю TDD/BDD подход к разработке. Стараюсь добится высокой степени покрытия кода тестами. Достигаю продуктивности за счет улучшения качества, а не за счет его ухудшения. Консультируюсь и консультирую других разработчиков по способам улучшить код, сделать его более гибким. Считаю программирование и способность писать понятный, легко поддерживаемый и качественный код искусством",
                            "competencyGroupId": 1,
                            "group": {
                                "id": 1,
                                "code": "programmingTheory",
                                "name": "Теория программирования"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        },
                        {
                            "id": 4,
                            "code": "devTesting",
                            "name": "Тестирование с точки зрения web-разработчика",
                            "level1": "Знаю, что нужно запускать автотесты как можно чаще. Понимаю, что нужно делать автотесты самостоятельно, а не только полагаться на автотесты, сделанные коллегами. Знаю о том, что тестировать - задача не только тестировщика, но и разработчика",
                            "level2": "Иногда разрабатываю модульные (unit) тесты. Имею опыт использования xUnit фреймфворка тестирования backend'а (phpunit) или frontend'а (jasmine, qunit, nightwatch, jest). Владею понятиями: тест-план, тест-дизайн, тест-анализ, умею писать хорошие баг-репорты для себя и других разработчиков. Понимаю отличия, преимущества и недостатки тестирования методами чёрного ящика, белого ящика, серого ящика",
                            "level3": "Имею представление о классах эквивалентности. Имею представление и практический опыт написания других видов тестов: интеграционное, системное, функциональное, регрессионное, приемочное и пр. Имею опыт разработки некоторых из указанных видов тестов. Имею представление о средствах автоматизации тестирования браузера и UI (selenium, appium). Имею представление о Data-driven Testing",
                            "level4": "Отлично владею методиками автоматизированного тестирования. Знаком с каким-либо фреймворком тестирования (py.test, xUnit frameworks). Имею представление о методиках и фреймворках Keyword-driven testing, Behavior-driven testing (behat), Model-based testing",
                            "competencyGroupId": 1,
                            "group": {
                                "id": 1,
                                "code": "programmingTheory",
                                "name": "Теория программирования"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        },
                        {
                            "id": 5,
                            "code": "taskAnalysis",
                            "name": "Анализ задач",
                            "level1": "Поручаю анализ проблемы другим людям (для этого есть системные и бизнес-аналитики). Выполняю задачу в том виде, в котором она описана. Ожидаю полное и подробное описание задачи, подробное техническое задание прежде, чем приступать к работе. Считаю, что ТЗ должно быть таким, чтобы при выполнении задачи не возникало вопросов",
                            "level2": "Вплотную работаю с менеджером. Задаю вопросы, когда возникают. Запрашиваю информацию, когда не хватает. Стараюсь выполнить задачу как можно лучше с технической точки зрения. Бывает, не понимаю, кому и зачем нужна задача. Приступаю к разработке сразу, как только есть минимум необходимой информации",
                            "level3": "Перед тем, как приступать к выполнению задачи, анализирую возможные варианты решения. Выбираю и делаю лучший вариант в пределах своих профессиональных компетенций.  Провожу декомпозицию задач, могу составить план и выстроить последовательность задач, которые необходимо выполнить, чтобы достичь требуемого результата. Занимаюсь синтезом общих решений из частных. Предпочитаю работать с хозяином задачи напрямую. К менеджеру обращаюсь за решением организационных вопросов",
                            "level4": "Анализирую каждую задачу и учитываю не только технические факторы, но и бизнес-факторы, необходимости хозяина задачи. Анализирую затраты и риски. Стараюсь подходить к задаче со всех сторон. Подробно изучаю и пытаюсь выявить суть задачи, разобраться в домене знаний, привлечь экспертов и добраться до необходимых данных, в том случае, если имеющихся данных недостаточно. Могу предложить альтернативные варианты действий, в том случае, если в ходе анализа выяснилась невозможность или нецелесообразность выполнения задачи",
                            "competencyGroupId": 1,
                            "group": {
                                "id": 1,
                                "code": "programmingTheory",
                                "name": "Теория программирования"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": 2,
                    "code": "programmingPractice",
                    "name": "Практика программирования",
                    "competencies": [
                        {
                            "id": 6,
                            "code": "baseWebDevelopment",
                            "name": "Основы веб-программирования",
                            "level1": "Имею базовые понятия о клиент-серверной архитектуре, понимаю чем различается клиентская и серверная часть. Знаю HTML, CSS. Могу делать несложные статичые страницы. Знаю, что такое DOM, AJAX. Знаю основы JavaScript",
                            "level2": "Неплохо знаю JavaScript и какой-либо серверный язык (в т.ч. JavaScript). Знаю основные способы хранения и передачи состояния на сервер. Знаю, что такое cookie, сессия, могу использовать их на сервере",
                            "level3": "Знаю HTML5, CSS3. Знаю SQL, могу работать с базой данных. Знаю и могу работать с API браузера: Window, Document, LocalStorage, History и др. Понимаю архитектурный стиль REST, знаю протоколы HTTP, SOAP. Знаю как организованы и могу разрабатывать RESTful веб-службы. Хорошо знаю и понимаю форматы передачи данных XML, JSON. Знаю, что такое CRUD",
                            "level4": "Знаю, как работает кэширование, gzip-сжатие. Знаю, как и для чего используются заголовки Last-Modified, ETag, Content-Encoding, Content-Type, Referer, User-Agent. Знаю, что такое CORS и для чего он нужен. Знаю, как и для чего используется заголовок Access-Control-Allow-Origin. Хорошо ориентируюсь в HTTP-статусах ответов: 200, 300, 400, 500",
                            "competencyGroupId": 2,
                            "group": {
                                "id": 2,
                                "code": "programmingPractice",
                                "name": "Практика программирования"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                },
                                {
                                    "id": 2,
                                    "code": "tester",
                                    "name": "Тестировщик (Python)"
                                }
                            ]
                        },
                        {
                            "id": 7,
                            "code": "databases",
                            "name": "Базы данных",
                            "level1": "Могу подключаться к базе данных при помощи клиента, делать несложные SQL-запросы: SELECT, INSERT, UPDATE, DELETE",
                            "level2": "Могу выполнять сложные запросы, использовать JOIN, ORDER BY, GROUP BY, HAVING, подзапросы.  Могу составить запросы на изменение схемы. Знаю как использовать функции SQL, в том числе аггрегатные. Знаю, что такое виды и как их создавать. Знаю как создавать и использовать индексы. Знаю и могу использовать транзакции, понимаю, что такое атомарные операции",
                            "level3": "Знаю, как использовать переменные SQL. Могу разрабатывать собственные функции и хранимые процедуры,  в т.ч. со сложной логикой. Знаю, что такое курсор. Имею опыт работы с NoSQL базами данных, могу делать запросы. Знаком с хранилищами ключ-значение (MemcacheDB, Beanstalk, Redis), могу подключаться и делать запросы",
                            "level4": "Хорошо знаю теорию баз данных. Знаю нормальные формы (6 штук + доменно-ключевая + Бойса-Кодда), для чего они нужны. Знаю когда и почему нужна денормализация. Знаю про ACID и теорему CAP. Хорошо знаю несколько различных реализаций SQL (MySQL, PostgreSQL, MSSQL, Oracle). Могу оптимизировать настройки серверов, организовать кластеризацию и репликацию данных. Знаком с какими-либо другими типами баз данных: колоночными БД (Hbase, Cassandra), документ-ориентированными БД (CouchDB, MongoDB), графовыми БД (InfiniteGraph, FlockDB). Могу работать с ними на уровне запросов",
                            "competencyGroupId": 2,
                            "group": {
                                "id": 2,
                                "code": "programmingPractice",
                                "name": "Практика программирования"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                },
                                {
                                    "id": 2,
                                    "code": "tester",
                                    "name": "Тестировщик (Python)"
                                }
                            ]
                        },
                        {
                            "id": 8,
                            "code": "dataScience",
                            "name": "Анализ данных",
                            "level1": "Знаю о необходимости анализа данных. Понимаю, что принятие интуитивных решений, исходя только из собственного опыта работы, может привести к серьезным ошибкам",
                            "level2": "Перед принятием решения стараюсь проконсультироваться с коллегами, проанализировать имеющиеся данные. Анализ данных делаю, в основном визуально, использую простые выборки из баз данных. Знаком с A/B тестированием, иногда приходилось принимать в нем участие. Умею анализировать данные сплит-тестирования",
                            "level3": "Владею техниками многомерного анализа. Знаком с OLAP, могу построить OLAP-куб при помощи специализированного ПО (Microsoft Analysis Services, Pentaho Mondrian). Знаю MDX, могу составлять запросы и анализировать результаты. Приходилось работать с Data Warehouse",
                            "level4": "Владею основами статистического анализа. Знаю что такое выборка и какой она должна быть. Владею понятиями распределение (нормальное, Стьюдента), доверительный интервал, значимость, дисперсия, p-значение, стандартное отклонение. Знаю, как правильно получить и обработать данные из базы данных, чтобы принять решение, обоснованное статистически достоверными данными. Доводилось работать со специализированными программными пакетами для статистического анализа (Statistica, Matlab, R, SPSS). Знаком с кластерным анализом, математическим моделированием",
                            "competencyGroupId": 2,
                            "group": {
                                "id": 2,
                                "code": "programmingPractice",
                                "name": "Практика программирования"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        },
                        {
                            "id": 9,
                            "code": "frontendTech",
                            "name": "Технологии фронта",
                            "level1": "Знаю как подключать нужные библиотеки при помощи тэга &lt;script&gt; в теле страниц. Каждую страницу рассматриваю отдельно, либо использую CMS с шаблонами страниц. Использую jQuery, jQuery-UI или аналогичную универсальную библиотеку при написании кода. Приходилось использовать Backbone.js, Underscore.js/Lodash. Могу верстать несложные страницы, знаю какие-либо универсальные ферймворки: Bootstrap, Foundation, Skeleton",
                            "level2": "Имею опыт разработки SPA на каком-либо фремворке: Angular.js, Vue.js, Ember.js, Meteor.js, React.js/Redux, i-bem.js. Знаком с модулями и их различной реализацией. Знаком с модульным CSS",
                            "level3": "Имею опыт работы с системой сборки (Browserify, Webpack), менеджером пакетов (bower, npm, yarn), системой запуска задач (Gulp.js, Grunt). Прекрасно разбираюсь в препроцессорах CSS (SASS/SCSS, LESS, PostCSS), JS (Babel), линтерах (JSLint, JSHint, ESLint), минификаторах/обфускаторах (Uglify.js, Google Closure Compiler, JSMin), оптимизаторах (Prepack). Знаю несколько различных архитектур SPA. Могу отлаживать JS-код при помощи IDE",
                            "level4": "Имею опыт разработки на разных фреймворках, с разными системами сборки, менеджерами пакетов и системами запуска задач. Знаю сильные и слабые стороны разных стэков и решений. Имею опыт разработки на TypeScript/CoffeeScript и пр. Прекрасно знаком с SPA различной архитектуры, могу начать с нуля",
                            "competencyGroupId": 2,
                            "group": {
                                "id": 2,
                                "code": "programmingPractice",
                                "name": "Практика программирования"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        },
                        {
                            "id": 10,
                            "code": "javascript",
                            "name": "JavaScript",
                            "level1": "Знаю базовый синтаксис языка, могу писать несложные приложения. Имею представление о паттернах подключения модулей common и amd. Знаю по крайней мере один способ организации наследования в JS. Понимаю нюансы использования this в контексте некоторых вариантов наследования. Имею представление о типизации в js и понимаю почему использование строгих типов важно для безопастности приложения. Имею представление о приведении к общему типу (coercion) при использовании '==' и понимаю, почему это не всегда безопасно. Понимаю как работает асинхронный код. Знаю, что такое callback hell и знаю как его избежать",
                            "level2": "Имею неплохое представление об области видимости, контексте. Имею представление о динамических областях видимости, о функциях, их создающих, и понимаю чем они отличаются от лексических. Понимаю, какое влияние на производительность оказывает динамическая область видимости. Имею опыт использования и предаставление о работе Promise, знаю чем отличается использование Promise и callback-функций. Имею опыт написания кода на ванильном JS. Понимаю необходимость оптимизации производительности кода и знаю, как ее проводить на практике",
                            "level3": "Прекрасно знаю ES2015 и более поздние стандарты. Использую ES2015+ элементы кода на интуитивном уровне. Понимаю плюсы и минусы использования различных элементов ES2015+ (const, fat arrow и тд). Имею представление о построении ассихронного кода в сихронном виде. Понимаю принципы работы генераторов и для решения каких проблем их можно использовать. Знаю когда рекурсия может быть опасной для стабильности приложения. Имею опыт реактивного программирования (rx, bacon, kefir). Знаю как внедрить, а также плюсы и минусы этих библиотек",
                            "level4": "Понимаю и могу использовать специальные термины такие как shadowing, hoisting, IIFE и тд. Имею представление о патернах оптимизации скорости работы кода и загрузки скриптов. Понимаю как работает режим полного соответствия современному стандарту. Понимаю почему важно использование этого режима с разных сторон в том числе с точки зрения производительности кода. Имею представление о глобальном объекте и его назначении. Понимаю как он работает в обыном режиме и режиме полного соответствия стандарту. Имею представление о способах оптимизации производительности кода (в т.ч. с использованием setTimeout, Duff's Device). Имею представление о цепи областей видимости (scope chain) и о цепи прототипов (prototype chain)",
                            "competencyGroupId": 2,
                            "group": {
                                "id": 2,
                                "code": "programmingPractice",
                                "name": "Практика программирования"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        },
                        {
                            "id": 11,
                            "code": "php",
                            "name": "Технологии бэкенда (PHP)",
                            "level1": "Неплохо знаю PHP, его основные возможности, стандартную библиотеку PHP и расширения. Знаю принципы работы автозагрузки и способы организации PHP-кода и библиотек. Знаю, как можно подключать и использовать сторонние библиотеки",
                            "level2": "Использую composer. Знаю стандарты PSR-0, PSR-4 и применяю их на практике. Имею опыт разработки на каком-либо фреймворке (Symfony 2/3, Laravel 4/5, Yii 1/2, Zend Framework 1/2 или другом). Имею опыт использования как ORM (Propel, Eloquent, Doctrine), так и PDO. Имею опыт работы с популярными библиотеками: Carbon, ImageWorkshop, Twig, Guzzle, Goutte, SwiftMailer, Mockery, библиотеки The PHP League. Имею опыт разботы с хранилищами ключ-значение (Redis, Memcached, Beanstalkd). Могу отлаживать код при помощи IDE",
                            "level3": "Имею опыт разработки на нескольких крупных фреймворках. Имею опыт работы с системами очередей (ZMQ, RabbitMQ, ActiveMQ, Amazon SQS). Имею опыт работы с поисковыми системами (Apache Lucene, Apache Solr, Elasticsearch, Sphinx). Имею как опыт разработки монолитных приложений, так и опыт построения микросервисной архитектуры. Имею опыт разработки систем авторизации и аутентификации на базе протоколов OAuth 1/2, OpenID, JWT, расличных систем с ACL. Имею опыт backend-разработки на других языках (JavaScript/NodeJS, Ruby), а также использования фреймворков для этого (Express, Koa, Rails)",
                            "level4": "Имею опыт разработки систем, работающих с высокой нагрузкой или огромным объемом данных. Знаком с ситуациями, когда разница между O(n^2) и O(nlogn) становится значимой, когда проблемы нагрузки нельзя решить железом. Приходилось исправлять баги в библиотеках, платформах, компиляторах",
                            "competencyGroupId": 2,
                            "group": {
                                "id": 2,
                                "code": "programmingPractice",
                                "name": "Практика программирования"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": 3,
                    "code": "environment",
                    "name": "Окружение и сопроводительное ПО",
                    "competencies": [
                        {
                            "id": 12,
                            "code": "vcs",
                            "name": "Система контроля версий",
                            "level1": "Знаю о том, что периодических резервных копий кода не достаточно. Знаю о том, что в работе над кодом лучше использовать систему контроля версий, даже если я работаю в одиночку. Понимаю почему",
                            "level2": "Знаю основы одной из системы контроля версий. Могу создать ветку, коммит. Могу отправить данные в удаленный репозиторий",
                            "level3": "Хорошо знаю одну из систем контроля версий. Могу делать rebase, переносить, изменять и удалять коммиты. Могу подключать и управлять несколькими удаленными репозиториями. Могу делать пулл-запросы и подключать ветки других разработчиков. Знаю несколько способов организовать совместную работу при помощи VCS (workflows)",
                            "level4": "Прекрасно знаю несколько систем контроля версий (CVS, SVN, Git, Mercurial, Fossil), их преимущества и недостатки. Могу выбрать нужную в зависимости от проекта и потребностей. Могу использовать дополнительные возможности VCS (хуки, интеграция со внешними скриптами). Знаю как работают VCS изнутри",
                            "competencyGroupId": 3,
                            "group": {
                                "id": 3,
                                "code": "environment",
                                "name": "Окружение и сопроводительное ПО"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        },
                        {
                            "id": 13,
                            "code": "buildAutomation",
                            "name": "Автоматизация сборки",
                            "level1": "Имею теоретическое представление о том, что такое автоматизация сборки. Знаю как минифицировать или оптимизировать файлы вручную",
                            "level2": "Знаком с одной из систем автоматизации сборки (Gulp, Grunt, Webpack) на базовом уровне: понимаю что это и зачем нужно, могу использовать готовый процесс сборки, вносить в него изменения. Знаком с одним из менеджеров пакетов (npm, bower, yarn)",
                            "level3": "Отлично знаком с одной из систем автоматизации сборки. Могу настроить сборку с нуля: написать конфигурации, выбрать плагины, отладить процесс до получения нужного результата. Есть опыт работы со сложными и многоэтапными сборками. Отлично знаю основные плагины и особенности их применения",
                            "level4": "Отлично знаком с несколькми системами автоматизации сборки и с несколькими менеджерами пакетов, знаю их сильные и слабые стороны, могу выбрать подходящий для проекта. Имею большой опыт автоматизации и поддержки сложных сборок с нуля. Знаю, что такое многовходовая сборка. Имею опыт разработки нестандартных и сложных конфигураций. Имею опыт сборки legacy-кода. Приходилось объединять системы на нескольких фреймворках",
                            "competencyGroupId": 3,
                            "group": {
                                "id": 3,
                                "code": "environment",
                                "name": "Окружение и сопроводительное ПО"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        },
                        {
                            "id": 14,
                            "code": "operatingSystems",
                            "name": "Операционная система",
                            "level1": "Умею работать с операционной системой на уровне пользователя. Умею устанавливать и удалять программы, подключаться к сетям",
                            "level2": "Неплохо знаю консоль, консольные команды и скрипты. Знаю операционную систему на достаточно глубоком уровне: конфигурационные файлы/реестр, программные компоненты ОС. Могу разобраться с драйверами и оборудованием, если возникнет потребность. Могу установить и настроить операционную систему. Имею опыт работы с виртуализацией: могу создавать и настраивать виртуальные машины, устанавливать и использовать ОС в виртуалках",
                            "level3": "Разбираюсь в операционной системе на уровне системного администрирования. Могу устанавливать и настраивать серверные компоненты, могу организовать сетевое взаимодействие. Имею неплохие представления об архитектуре компьютера, о сетевых коммуникациях, протоколах",
                            "level4": "Разбираюсь в нескольких операционных системах на уровне системного администрирования. Знаю несколько консолей и несколько наборов системных комманд. Могу решить любую задачу средствами любой операционной системы, но так же выбираю ОС рационально, в зависимости от удобства в решении моих задач. Неоднократно приходилось разворачивать и настраивать серверное ПО в разных средах, под разные задачи и проекты (Apache, Nginx, MySQL, PostgreSQL и пр.)",
                            "competencyGroupId": 3,
                            "group": {
                                "id": 3,
                                "code": "environment",
                                "name": "Окружение и сопроводительное ПО"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                },
                                {
                                    "id": 2,
                                    "code": "tester",
                                    "name": "Тестировщик (Python)"
                                }
                            ]
                        },
                        {
                            "id": 15,
                            "code": "continuousIntegration",
                            "name": "Непрерывная интеграция",
                            "level1": "Имею теоретическое представление о работе систем непрерывной интеграции. Знаю как пользоваться услугами хостинговых компаний или настраивать все на своих серверах вручную. Имею опыт выгрузки кода через FTP/SFTP, приходилось вносить исправления в код непосредственно на боевых серверах",
                            "level2": "Использую систему контроля версий для выгрузки кода на боевые сервера. В случае возникновения проблем использую откат к предыдущему коммиту. Знаю о том, для чего нужны миграции баз данных и использую их для обновления боевой базы. Могу автоматизировать несложный процесс выгрузки",
                            "level3": "Знаком с непрерывной интеграцией (continuous integration). Понимаю, каким образом должна быть организована работа для этого процесса. Знаю, какие инструменты для этого необходимы и имею опыт работы с ними (Jenkins, TeamCity, Bamboo). Постоянно пополняю коллекцию модульных тестов и постоянно использую их в работе. Имею опыт работы по этой практике, знаю как разбивать задачи на небольшие блоки",
                            "level4": "Знаком с практиками DevOps. Знаю, чем отличается CI и CD. Имею опыт работы по непрерывной поставке, знаю, какие ограничения это накладывает на процесс разработки и что нужно делать, чтобы избежать возможных проблем. Знаком и пременяю на практике особые подходы к рефакторингу базы данных с учетом CD",
                            "competencyGroupId": 3,
                            "group": {
                                "id": 3,
                                "code": "environment",
                                "name": "Окружение и сопроводительное ПО"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        },
                        {
                            "id": 16,
                            "code": "ide",
                            "name": "IDE",
                            "level1": "Понимаю, какие преимущества дает использование IDE для работы. Приходилось писать код в текстовом редакторе (с подсветкой синтаксиса)",
                            "level2": "Использую IDE для написания кода, навигации по файлам, поиска фрагментов кода по проекту. Использую подсказки по функциям и аргументам. Могу установить и настроить необходимые плагины",
                            "level3": "Использую IDE для навигации по классам и функциям, для рефакторинга и отладки кода (xdebug, node.js debug). Дорабатываю код, чтобы сделать подсказки по классам и методам верными. Использую персонализированные настройки по форматированию кода, поддерживаю единый стиль форматирования кода с их помощью",
                            "level4": "Использую IDE для проведения сложного рефакторинга, для работы с системой контроля версий, базой данных, профилировщиком. Стараюсь минимально использовать мышь, отлично знаю и использую управляющие комбинации клавиш. Использую средства быстрой генерации кода. Имею обширный опыт работы с несколькими IDE, отлично знаю их преимущества и недостатки. Текущую IDE выбирал для себя рационально по множеству критериев",
                            "competencyGroupId": 3,
                            "group": {
                                "id": 3,
                                "code": "environment",
                                "name": "Окружение и сопроводительное ПО"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": 4,
                    "code": "common",
                    "name": "Общие навыки",
                    "competencies": [
                        {
                            "id": 17,
                            "code": "groupDevelopment",
                            "name": "Коллективная разработка",
                            "level1": "Имею опыт работы в одиночку, либо в команде, в которой каждый программист работает над своим направлением самостоятельно. Как правило, конфликтов при слиянии изменений не происходит, так как направления не пересекаются друг с другом. Все задачи доступны из трекера",
                            "level2": "Имею опыт работы в кроссфункциональной команде. Часто приходилось пересекаться с задачами других, делать rebase и устранять конфликты. Понимаю важность общего домена знаний в разработке. Стараюсь рассказывать о своих наработках команде, задавать свои вопросы и отвечать на вопросы других. Приходилось совместно работать над одной задачей вместе с другим разработчиком. Знаю про парное программирование",
                            "level3": "Имею большой опыт работы по какой-либо гибкой методологии: scrum, kanban, lean. Понимаю необходимость каждого этапа и каждого ритуала в этих процессах. Знаю основные положения манифеста Agile и понимаю их суть. Имею опыт работы по каскадной модели. Глубоко понимаю преимущества и недостатки как каскадной методологии, так и гибких подходов",
                            "level4": "Имею опыт организации работы команды по гибким методологиям. Имею опыт построения процессов коллективной разработки. Имею опыт работы без менеджеров",
                            "competencyGroupId": 4,
                            "group": {
                                "id": 4,
                                "code": "common",
                                "name": "Общие навыки"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        },
                        {
                            "id": 18,
                            "code": "decisionMaking",
                            "name": "Принятие решений",
                            "level1": "Приходилось работать в процессах, где обсуждения, на которых вырабатываются какие-то решения, проходят за закрытыми дверями",
                            "level2": "Обычно являюсь самым опытным разработчиком в коллективе и часто имею собственное мнение по разным вопросам. Считаю правильным его отстаивать даже когда у других коллег альтернативные взгляды",
                            "level3": "Обсуждая решения стараюсь приводить факты, на которых основываю свои рассуждения. Трачу достаточно большое количество усилий на поиск фактического материала. Часто бывает так, что в ходе подбора фактических данных моя точка зрения не подтверждается и я меняю ее в этом случае",
                            "level4": "Активно интересуюсь позицией других коллег, помогаю им выработать собственные решения предоставляя нужные данные и помощь в разных вопросах. Обычно высказываю свою точку зрения в случаях, когда ко мне обращаются непосредственно за ней. Могу менять свою точку зрения в ходе общения с другими людьми. Могу обозначить сильные и слабые стороны решений не вызвав стрессовую защитную реакцию",
                            "competencyGroupId": 4,
                            "group": {
                                "id": 4,
                                "code": "common",
                                "name": "Общие навыки"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        },
                        {
                            "id": 19,
                            "code": "learning",
                            "name": "Обучение",
                            "level1": "Использую Google для поиска информации по конкретным вопросам, связанным с выполнением задач. Часто применяю решения, найденные в интернете подстраивая их под текущий код на проекте. Иногда читаю статьи по разработке",
                            "level2": "Знаю свои слабые стороны, что надо подтянуть. Читаю книги или обучаюсь на курсах, стараюсь всесторонне закрывать пробелы в знаниях. Читаю специализированную литературу по разработке",
                            "level3": "Делюсь с другими знаниями по тем областям, в которых чувствую себя уверено. Объясняю, показываю, даю информацию и ссылки. Пишу обучающие статьи или видео. Участвую в конференциях как слушатель",
                            "level4": "Пишу объемные статьи или доклады по сложным темам. Веду блог по разработке. Участвую в конференциях как докладчик. Уделяю много времени передаче знаний",
                            "competencyGroupId": 4,
                            "group": {
                                "id": 4,
                                "code": "common",
                                "name": "Общие навыки"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        },
                        {
                            "id": 20,
                            "code": "codeReview",
                            "name": "Ревизия кода",
                            "level1": "Знаю, что некоторые считают ревизию кода важной. Бывает так, что при проведении ревизии не вчитываюсь в код и замечаний не имею",
                            "level2": "Стараюсь внимательно просматривать пулл-запросы. Критикую плохой код и указываю на явные и скрытые ошибки разработки. Критикую несоответствие стандартам",
                            "level3": "Уделяю значительное время ревизии кода. Стараюсь выражать замечания в продуктивной форме, чтобы не вызвать сопротивление или негативную реакцию автора. Предлагаю альтернативные способы реализации или способы устранить обнаруженные проблемы",
                            "level4": "Могу провести ревизию кода в больших задачах. Внимательно изучаю код не только по формальным признакам, но пытаюсь понять архитектурные задумки автора. Задаю вежливые уточняющие вопросы в ходе анализа. Могу предложить несколько альтернативных решений по обнаруженным проблемам",
                            "competencyGroupId": 4,
                            "group": {
                                "id": 4,
                                "code": "common",
                                "name": "Общие навыки"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        },
                        {
                            "id": 21,
                            "code": "deadlineAssessment",
                            "name": "Оценка сроков",
                            "level1": "Стараюсь избегать оценок длительности задачи, так как оценить их очень сложно. Вопросы о сроках считаю некорректными",
                            "level2": "Могу назвать ориентировочный срок выполнения задачи, но часто не получается его выполнить. Даю оценку быстро, ориентируюсь на внутреннее чувство времени",
                            "level3": "Имею поправочный коэффициент (3.14159265359 или какой-то другой), на который умножаю свою оценку, чтобы получить более-менее точные данные. Поправочный коэффициент оценил из практики наблюдений за собственными оценками и реальными сроками исполнения задач",
                            "level4": "Различаю оценку времени выполнения и оценку сложности задачи. Даю оценку времени в зависимости от класса сложности задач. Применял на практике коллективные методы оценки сложности или времени выполнения задач (покер планирования, круговая оценка). Обычно даю оценку вилкой (минимальное и максимальное время) или по трем точкам (минимальное, максимальное и наиболее вероятное)",
                            "competencyGroupId": 4,
                            "group": {
                                "id": 4,
                                "code": "common",
                                "name": "Общие навыки"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": 5,
                    "code": "experience",
                    "name": "Опыт",
                    "competencies": [
                        {
                            "id": 22,
                            "code": "projectSupport",
                            "name": "Поддержка проектов",
                            "level1": "В основном работал с проектами с небольшим сроком жизни. Не приходилось поддерживать проекты дольше 1 года",
                            "level2": "Приходилось переписывать проекты с нуля и вводить их в боевую эксплуатацию. Знаком на практике с положительными и отрицательными сторонами подобного подхода",
                            "level3": "Знаю о пределе технической сложности проекта, за которым его уже нельзя переписать. Приходилось работать с подобными проектами. Имею большой опыт работы с техническим долгом и знаю как сделать так, чтобы он уменьшался, а не увеличивался. Умею не жалуясь заниматься рефакторингом плохого кода",
                            "level4": "Приходилось \"принимать\" в поддержку хрупкие комки грязи проекты с большим техническим долгом и стабилизировать процесс их разработки и развития. Из опыта знаю, что нужно сделать для того, чтобы принять систему и что делать, чтобы она не развалилась при доработках в дальнейшем. Умею сдержать процесс интенсивных доработок, чтобы стабилизировать проект",
                            "competencyGroupId": 5,
                            "group": {
                                "id": 5,
                                "code": "experience",
                                "name": "Опыт"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        },
                        {
                            "id": 23,
                            "code": "openSource",
                            "name": "Участие в проектах с открытым исходным кодом",
                            "level1": "Использую проекты с открытым кодом в своей работе. Иногда заглядываю в исходные тексты или в багтреккер. Исходный код не трогаю, доверяю профессионалам, написавшим его",
                            "level2": "Приходилось сталкиваться с багами различных проектов с открытым кодом и оформлять PRы и дожидаться их решения. Имею опыт переписки с мейтейнерами проектов по найденным багам: предоставлял сведения, способ воспроизведения и пр. Делал форки проектов для доработки функционала или исправления проблем",
                            "level3": "Участвовал в проекте с открытым кодом в качестве комиттера: решал обнаруженные баги или добавлял новый функционал. Делал пулл-запросы, проходил ревизию кода. Мои изменения вливались в master-ветку проекта. Сталкивался с плохим кодом в открытых проектах, исправлял его",
                            "level4": "У меня есть свои используемые проекты с открытым кодом. Я являюсь регулярным комиттером крупного проекта, иногда исправляю баги, обнаруженные другими людьми. Имею продолжительный опыт работы над большим open-source проектом",
                            "competencyGroupId": 5,
                            "group": {
                                "id": 5,
                                "code": "experience",
                                "name": "Опыт"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": 6,
                    "code": "other",
                    "name": "Прочее",
                    "competencies": [
                        {
                            "id": 24,
                            "code": "foreignLanguages",
                            "name": "Знание иностранных языков",
                            "level1": "Знаю родной язык. Ищу информацию на родном языке. Пользуюсь автоматическим переводчиком для чтения ресурсов на иностранном языке",
                            "level2": "Знаю английский язык на уровне, достаточном для чтения профессиональной литературы (Beginner, Elementary, Pre-Intermediate). Изучал иностранный язык в школе (возможно не английский)",
                            "level3": "Знаю английский на достаточном для полноценного письменного общения уровне (Intermediate, Upper-Intermediate). Могу понимать английскую речь в обычном темпе. Могу поддерживать (несколько скованно) разговор на бытовые и профессиональные темы. Имею опыт деловой и технической переписки на английском. Возможно, знаю дополнительные языки на базовом уровне понимания/чтения",
                            "level4": "Знаю английский язык на уровне свободного владения (Advanced, Proficiency). Могу без препятствий общаться как устно, так и письменно. Имею сертификаты TOEFL или IELTS",
                            "competencyGroupId": 6,
                            "group": {
                                "id": 6,
                                "code": "other",
                                "name": "Прочее"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        },
                        {
                            "id": 25,
                            "code": "insurance",
                            "name": "Предметная область страхования",
                            "level1": "Знаком с областью страхования на бытовом уровне. Приходилось покупать страховые полисы. Знаю чем страхователь отличается от страховщика и застрахованного",
                            "level2": "Знаю базу страхования: риск, опции, страховая сумма, страховое покрытие, страховой случай, франшиза, страховая премия, ассистанс",
                            "level3": "Имею опыт работы в страховании. Знаю что такое бордеро, страховой тариф и чем условная франшиза отличается от безусловной. Изучал страхование целенаправлено",
                            "level4": "Долго работал в страховании, имею большой опыт в этой области. Знаю что такое суборгация, регресс, перестрахование, сострахование, нетто-ставка и брутто-ставка. Знаю чем занимаются андеррайтеры и актуарии. Иногда читаю специализированную литературу",
                            "competencyGroupId": 6,
                            "group": {
                                "id": 6,
                                "code": "other",
                                "name": "Прочее"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": 2,
            "code": "tester",
            "name": "Тестировщик (Python)",
            "competencyCount": 6,
            "courseCount": 7,
            "groups": [
                {
                    "id": 2,
                    "code": "programmingPractice",
                    "name": "Практика программирования",
                    "competencies": [
                        {
                            "id": 6,
                            "code": "baseWebDevelopment",
                            "name": "Основы веб-программирования",
                            "level1": "Имею базовые понятия о клиент-серверной архитектуре, понимаю чем различается клиентская и серверная часть. Знаю HTML, CSS. Могу делать несложные статичые страницы. Знаю, что такое DOM, AJAX. Знаю основы JavaScript",
                            "level2": "Неплохо знаю JavaScript и какой-либо серверный язык (в т.ч. JavaScript). Знаю основные способы хранения и передачи состояния на сервер. Знаю, что такое cookie, сессия, могу использовать их на сервере",
                            "level3": "Знаю HTML5, CSS3. Знаю SQL, могу работать с базой данных. Знаю и могу работать с API браузера: Window, Document, LocalStorage, History и др. Понимаю архитектурный стиль REST, знаю протоколы HTTP, SOAP. Знаю как организованы и могу разрабатывать RESTful веб-службы. Хорошо знаю и понимаю форматы передачи данных XML, JSON. Знаю, что такое CRUD",
                            "level4": "Знаю, как работает кэширование, gzip-сжатие. Знаю, как и для чего используются заголовки Last-Modified, ETag, Content-Encoding, Content-Type, Referer, User-Agent. Знаю, что такое CORS и для чего он нужен. Знаю, как и для чего используется заголовок Access-Control-Allow-Origin. Хорошо ориентируюсь в HTTP-статусах ответов: 200, 300, 400, 500",
                            "competencyGroupId": 2,
                            "group": {
                                "id": 2,
                                "code": "programmingPractice",
                                "name": "Практика программирования"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                },
                                {
                                    "id": 2,
                                    "code": "tester",
                                    "name": "Тестировщик (Python)"
                                }
                            ]
                        },
                        {
                            "id": 7,
                            "code": "databases",
                            "name": "Базы данных",
                            "level1": "Могу подключаться к базе данных при помощи клиента, делать несложные SQL-запросы: SELECT, INSERT, UPDATE, DELETE",
                            "level2": "Могу выполнять сложные запросы, использовать JOIN, ORDER BY, GROUP BY, HAVING, подзапросы.  Могу составить запросы на изменение схемы. Знаю как использовать функции SQL, в том числе аггрегатные. Знаю, что такое виды и как их создавать. Знаю как создавать и использовать индексы. Знаю и могу использовать транзакции, понимаю, что такое атомарные операции",
                            "level3": "Знаю, как использовать переменные SQL. Могу разрабатывать собственные функции и хранимые процедуры,  в т.ч. со сложной логикой. Знаю, что такое курсор. Имею опыт работы с NoSQL базами данных, могу делать запросы. Знаком с хранилищами ключ-значение (MemcacheDB, Beanstalk, Redis), могу подключаться и делать запросы",
                            "level4": "Хорошо знаю теорию баз данных. Знаю нормальные формы (6 штук + доменно-ключевая + Бойса-Кодда), для чего они нужны. Знаю когда и почему нужна денормализация. Знаю про ACID и теорему CAP. Хорошо знаю несколько различных реализаций SQL (MySQL, PostgreSQL, MSSQL, Oracle). Могу оптимизировать настройки серверов, организовать кластеризацию и репликацию данных. Знаком с какими-либо другими типами баз данных: колоночными БД (Hbase, Cassandra), документ-ориентированными БД (CouchDB, MongoDB), графовыми БД (InfiniteGraph, FlockDB). Могу работать с ними на уровне запросов",
                            "competencyGroupId": 2,
                            "group": {
                                "id": 2,
                                "code": "programmingPractice",
                                "name": "Практика программирования"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                },
                                {
                                    "id": 2,
                                    "code": "tester",
                                    "name": "Тестировщик (Python)"
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": 3,
                    "code": "environment",
                    "name": "Окружение и сопроводительное ПО",
                    "competencies": [
                        {
                            "id": 14,
                            "code": "operatingSystems",
                            "name": "Операционная система",
                            "level1": "Умею работать с операционной системой на уровне пользователя. Умею устанавливать и удалять программы, подключаться к сетям",
                            "level2": "Неплохо знаю консоль, консольные команды и скрипты. Знаю операционную систему на достаточно глубоком уровне: конфигурационные файлы/реестр, программные компоненты ОС. Могу разобраться с драйверами и оборудованием, если возникнет потребность. Могу установить и настроить операционную систему. Имею опыт работы с виртуализацией: могу создавать и настраивать виртуальные машины, устанавливать и использовать ОС в виртуалках",
                            "level3": "Разбираюсь в операционной системе на уровне системного администрирования. Могу устанавливать и настраивать серверные компоненты, могу организовать сетевое взаимодействие. Имею неплохие представления об архитектуре компьютера, о сетевых коммуникациях, протоколах",
                            "level4": "Разбираюсь в нескольких операционных системах на уровне системного администрирования. Знаю несколько консолей и несколько наборов системных комманд. Могу решить любую задачу средствами любой операционной системы, но так же выбираю ОС рационально, в зависимости от удобства в решении моих задач. Неоднократно приходилось разворачивать и настраивать серверное ПО в разных средах, под разные задачи и проекты (Apache, Nginx, MySQL, PostgreSQL и пр.)",
                            "competencyGroupId": 3,
                            "group": {
                                "id": 3,
                                "code": "environment",
                                "name": "Окружение и сопроводительное ПО"
                            },
                            "professions": [
                                {
                                    "id": 1,
                                    "code": "webDeveloper",
                                    "name": "Веб-разработчик (PHP)"
                                },
                                {
                                    "id": 2,
                                    "code": "tester",
                                    "name": "Тестировщик (Python)"
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": 6,
                    "code": "other",
                    "name": "Прочее",
                    "competencies": [
                        {
                            "id": 27,
                            "code": "probabiltyBasics",
                            "name": "Основы теории вероятности",
                            "level1": "Знаю, что такое размещения, перестановки и сочетания",
                            "level2": "Знаю, что такое биномиальные коэффициенты, математическое ожидание, дисперсия",
                            "level3": "Знаю, что такое условная вероятность, теорема Байеса",
                            "level4": "Знаю, что такое основные распределения (нормальное, биномиальное, Стьюдента, Пуассона, Трейси-Видома)",
                            "competencyGroupId": 6,
                            "group": {
                                "id": 6,
                                "code": "other",
                                "name": "Прочее"
                            },
                            "professions": [
                                {
                                    "id": 2,
                                    "code": "tester",
                                    "name": "Тестировщик (Python)"
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": 7,
                    "code": "testingPractice",
                    "name": "Практика тестирования",
                    "competencies": [
                        {
                            "id": 28,
                            "code": "handTesting",
                            "name": "Ручное тестирование",
                            "level1": "Владею понятиями Тест-план, Тест-кейз, баг, эффект пестицида. Умею работать с багтрекером. Умею работать с функциональными требованиями. Знаю, что такое классы эквивалентности. Умею анализировать границы и формировать разбиения области тестирования",
                            "level2": "Знаю особенности и преимущества методики тестирования чёрным/белым/серым ящиком и их различия. Владею понятиями компонентного, системного, интеграционного тестирования. Знаю типы и виды тестирования (регрессионное, стресс, приёмочное). Умею строить тест-план, тест-кейзы. Умею тестировать юзабилити. Умею работать с причинно-следственными диаграммами и выполнять анализ модели состояния или переходов. Умею оценивать покрытие кода и требований тестами (покрытие функций, условий, решений)",
                            "level3": "Владею понятиями веб-сервер, веб-клиент. Знаю о типах запросов (POST, GET и другие) и умею строить такие запросы. Умею пользоваться средствами перехвата запросов (Fiddler). Знаю о различных протоколах, используемых в веб (HTTP, JSON, FTP, telnet, SMTP, POP)",
                            "level4": "Умею тестировать защищённость приложений на уровне веб. Владею понятиями SQL-инъекций, XSS (Cross Site Scripting). Умею выполнять нагрузочное тестирование (JMeter, HP Load Runner). Умею собирать динамическое покрытие кода тестами",
                            "competencyGroupId": 7,
                            "group": {
                                "id": 7,
                                "code": "testingPractice",
                                "name": "Практика тестирования"
                            },
                            "professions": [
                                {
                                    "id": 2,
                                    "code": "tester",
                                    "name": "Тестировщик (Python)"
                                }
                            ]
                        },
                        {
                            "id": 29,
                            "code": "testAutomation",
                            "name": "Автоматизация тестирования",
                            "level1": "Знаю какой-либо из языков программирования, применяемых при автоматизации (python, java, javascript, C#), умею пользоваться соответствующими IDE. Умею пользоваться рекордерами сценариев. Умею выполнять инспекцию кода. Имею понятие о тест-дизайне",
                            "level2": "Умею пользоваться средствами отладки в CLI и IDE. Умею использовать Selenium и/или надстройки (Appium, Winium, Windows Application Driver). Владею понятиями Data Driven Testing, Behaviour Driven Testing, Model Driven Testing, Keyword Driven Testing. Знаю какие-нибудь шаблоны проектирования тестов (functional, PageObjects)",
                            "level3": "Знаю фреймворк, используемый при автоматизации (TestNG, jUnit, proboscis, pytest). Умею пользоваться надстройками для автоматизации тестирования производительности (Locust). Знаю альтернативные API (Watir, Selenide, FluentSelenium)",
                            "level4": "Владею знаниями о распределённом тестировании, знаю о Selenium Server, Selenium Grid, облачных сервисах тестирования.",
                            "competencyGroupId": 7,
                            "group": {
                                "id": 7,
                                "code": "testingPractice",
                                "name": "Практика тестирования"
                            },
                            "professions": [
                                {
                                    "id": 2,
                                    "code": "tester",
                                    "name": "Тестировщик (Python)"
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}