function getCoursesList() {
    return [
        {
            id: 1,
            platform: 'ТехноПрогресс',
            title: 'Альтернативы в подборе персонала: соцсети, крауд-сорсинговые платформы, современные подходы',
            url: 'http://www.cpobr.ru/alternativy_v_podbore_personala_socseti_kraud_sorsingovye_platformy_sovremennye_praktiki/',
            format: 'Вебинар',
            hasTeacher: true,
            hasPractice: false,
            certificate: 'Нет',
            city: 'Москва',
            duration: 2,
            durationUnits: 'ак. час',
            description: 'Бесплатный вебинар по теме «Альтернативы в подборе персонала: соцсети, крауд-сорсинговые платформы, современные подходы»',
            price: 0,
            skills: {
                'Использование социальных инструментов подбора': 1
            },
            requirements: {}
        },
        {
            id: 2,
            platform: 'ТехноПрогресс',
            title: 'Изменения в трудовом законодательстве 2018',
            url: 'http://www.cpobr.ru/izmeneniya_v_trudovom_zakonodatelstve_2018/',
            format: ['Вебинар', 'Очная'],
            hasTeacher: true,
            hasPractice: false,
            certificate: 'Государственного образца',
            city: 'Москва',
            duration: 8,
            durationUnits: 'ак. час',
            description: 'Для кого\n' +
                'Начинающим специалистам кадрового дела\n' +
                'Начальникам отдела кадров\n' +
                'Сотрудникам отдела кадров\n' +
                'Руководителям службы персонала\n' +
                'HR-менеджерам\n' +
                'Заведующим отделом кадров\n' +
                'Руководителям подразделений (служб) управления кадрами и трудовыми отношениями\n' +
                'Заместителям директора по управлению персоналом\n' +
                'Начальникам отдела организации и оплаты труда\n' +
                'Начальникам отдела подготовки кадров\n' +
                'Начальникам отдела социального развития\n' +
                'Заведующим (начальникам) отделом кадров\n' +
                'Сотрудников бухгалтерии\n' +
                '\n' +
                'По окончании вы будете уметь\n' +
                'Использовать новации в сфере трудовых отношений касательно: возрастных ограничений, привлечения к материальной ответственности, ненормированного рабочего дня и сверхурочной работы.\n' +
                'Ориентироваться в режиме водителей.\n' +
                'Знать ограничения на привлечение работы иностранцев (актуально к ЧМ2018), особенности миграционного учета.\n' +
                'Избегать ошибок при использовании профстандартов.\n' +
                'Охрана труда: обязательная спец.оценка. обучение, новые требования к спецодежде\n' +
                'Оплата труда: изменение размера МРОТ, наказание за отсутствие индексации.\n' +
                'Проверка ГИТ: изменения при плановых и внеплановых проверках.\n' +
                'Заранее проверять готовность компании к проверке по чек-листам ГИТ.\n' +
                'Пользоваться сервисом «Электронный инспектор»\n' +
                'Заверять кадровые документы в соответствии с новой процедурой.\n' +
                'Электронные листки нетрудоспособности.\n' +
                'Ужесточение ответственности за нарушения в области защиты персональных данных.\n' +
                'Электронные трудовые книжки.\n' +
                'Удержания из зарплаты, минимальный почасовой размер оплаты труда, предельный размер премий.\n' +
                'Новые главы Трудового кодекса РФ.',
            price: 7470,
            skills: {
                'Трудовой кодекс РФ': 3,
                'Кадровый учет': 3,
                'Составление трудовых договоров': 3
            },
            requirements: {
                'Трудовой кодекс РФ': 3,
                'Кадровый учет': 3,
                'Составление трудовых договоров': 3
            }
        },
        {
            id: 3,
            platform: 'ТехноПрогресс',
            title: 'Программа профессиональной переподготовки «Управление персоналом»',
            url: 'http://www.cpobr.ru/programma_professionalnoy_perepodgotovki_upravlenie_personalom/',
            format: ['Вебинар', 'Очная'],
            hasTeacher: true,
            hasPractice: false,
            certificate: 'Государственного образца',
            city: 'Москва',
            duration: 256,
            durationUnits: 'ак. час',
            description: 'Для кого\n' +
                'Начинающим специалистам кадрового дела\n' +
                'Начальникам отдела кадров\n' +
                'Сотрудникам отдела кадров\n' +
                'Руководителям службы персонала\n' +
                'HR-менеджерам\n' +
                'Заведующим отделом кадров\n' +
                'Руководителям подразделений (служб) управления кадрами и трудовыми отношениями\n' +
                'Заместителям директора по управлению персоналом\n' +
                'Начальникам отдела организации и оплаты труда\n' +
                'Начальникам отдела подготовки кадров\n' +
                'Начальникам отдела социального развития\n' +
                'Заведующим (начальникам) отделом кадров\n' +
                'Сотрудников бухгалтерии\n' +
                '\n' +
                'По окончании вы будете уметь\n' +
                'Разбираться в обязательных и вспомогательных локальных актах работодателя.\n' +
                'Регулировать работу сотрудников с персональными данными.\n' +
                'Оформлять приём на работу: от рядового работника до руководителя компании.\n' +
                'Исчислять отпускные и формировать график отпусков.\n' +
                'Правильно заполнять трудовую книжку.\n' +
                'Расторгать трудовой договор в соответствии с последними изменениями в законодательстве.\n' +
                'Составлять трудовой, срочный и гражданско-правовой договор, выявлять ошибки в кадровых документах, заключать срочный трудовой договор;\n' +
                'Оформлять дистанционных сотрудников – принимать на работу, заключать договор, заводить для надомных сотрудников трудовые книжки и СНИЛС, увольнять их в соответствии с требованиями законодательства;\n' +
                'Принимать на работу кандидатов по совместительству и совмещению, правильно рассчитывать оплату их труда и составлять приказы на увольнение;\n' +
                'Вести военно-учетный стол. Составлять кадровую документацию, в т.ч. вести журнал проверок, ставить и снимать работника с воинского учета.\n' +
                'Ориентироваться в обязательном перечне кадровых документов, необходимых для прохождения проверок.\n' +
                'Оформлять приём на работу: от рядового работника до руководителя компании;\n' +
                'Исчислять отпускные и формировать график отпусков.\n' +
                'Разбираться в основаниях для увольнения и выплатах.\n' +
                'Избегать ошибок в кадровом делопроизводстве при подготовке к проверке ГИТ.\n' +
                'Проводить мероприятия для успешного прохождения проверок.\n' +
                'Вести журнал учёта проверок юридического лица.\n' +
                'Организовывать работу персонала структурного подразделения.\n' +
                'Определять задачи персонала структурного подразделения, исходя из целей и стратегии организации.\n' +
                'Создавать и описывать организационную структуру, цели, задачи, функции структурного подразделения.\n' +
                'Применять методы управления межличностными отношениями, формирования команд, развития лидерства и исполнительности, выявления талантов, определения удовлетворенности работой.\n' +
                'Определять, анализировать, моделировать и выстраивать внутренние коммуникации персонала.\n' +
                'Разрабатывать проектные предложения и мероприятия по эффективной работе персонала.\n' +
                'Внедрять стратегию по управлению персоналом.\n' +
                'Составлять, рассчитывать, корректировать и контролировать статьи расходов на персонал, разрабатывать предложения по затратам на персонал для формирования бюджета.\n' +
                'Представлять интересы организации и вести переговоры с профессиональными союзами и другими представительными органами работников, взаимодействовать с государственными организациями.\n' +
                'Анализировать информацию по поставщикам услуг в области управления персоналом и по условиям заключаемых договоров.\n' +
                'Производить предварительные закупочные процедуры и оформлять сопутствующую документацию по заключению договоров.\n' +
                'Работать с информационными системами и базами данных по вопросам управления персоналом.\n' +
                'Организовывать и проводить корпоративные мероприятия с персоналом.\n' +
                'Разрабатывать стратегии и политики в управлении персоналом.\n' +
                'Создавать и описывать организационную структуру, цели, задачи, функции структурных подразделений и должностных лиц.\n' +
                'Применять методы управления межличностными отношениями, формирования команд, развития лидерства и исполнительности, выявления талантов, определения удовлетворенности работой.\n' +
                'Определять и анализировать внутренние коммуникации, моделировать поведение персонала.\n' +
                'Представлять интересы организации в государственных органах, во взаимодействии с профсоюзами, иными представительными органами работников по вопросам персонала.\n' +
                'Составлять, рассчитывать, корректировать и контролировать статьи расходов бюджетов и фондов на программы и мероприятия по управлению персоналом организации.\n' +
                'Проводить аудит и контроллинг в области управления персоналом\n' +
                'Разрабатывать корпоративные социальные программы.\n' +
                'Вести переговоры по вопросам социального партнерства с представительными органами работников.\n' +
                'Работать с информационными системами и базами данных по вопросам управления персоналом.\n' +
                'Организовывать мероприятия по обеспечению выполнения требований охраны труда в соответствии с действующим законодательством Российской Федерации и локальными актами организации.\n' +
                'Организовывать и проводить мероприятия с персоналом в соответствие  с корпоративной социальной политикой.\n' +
                'Организовывать HR-процессы в компании, рассчитывать основные показатели эффективности.\n' +
                'Определять цели и задачи должностных лиц, составлять должностные инструкции.\n' +
                'Организовывать материальную мотивацию персонала – компенсационный пакет и социальные программы.\n' +
                'Применять нематериальную мотивацию внутри компании.\n' +
                'Анализировать и изменять корпоративную культуру, определять ценности компании.\n' +
                'Проектировать численность персонала, подбирать кандидатов и помогать в адаптации новым сотрудникам.\n' +
                'Оценивать персонал и делать выводы о его эффективности.\n' +
                'Обучать и развивать сотрудников, управлять талантами.\n' +
                'Организовывать подразделение по управлению персоналом на предприятии, разрабатывать его стратегию и основные функции.\n' +
                'Проектировать и оптимизировать организационную структуру предприятия в соответствии с политикой управления персоналом.\n' +
                'Определять оптимальное количество персонала на предприятии.\n' +
                'Привлекать к работе одаренных сотрудников и выявлять лидеров в коллективе.\n' +
                'Создать привлекательные условия труда и разработать систему мотивации для сотрудников.\n' +
                'Объективно оценивать эффективность работы персонала.\n' +
                'Разрабатывать и внедрять принципы корпоративной культуры на предприятии.\n' +
                'Выстраивать эффективную систему оплаты труда на предприятии.\n' +
                'Грамотно составлять штатное расписание, положение, регулирующее оплату труда, должностные инструкции работников.\n' +
                'Определять оптимальное соотношение элементов, входящих в заработную плату.\n' +
                'Разрабатывать эффективную структуру премирования сотрудников по выполненным плановым показателям KPI, используя метод грейдов.\n' +
                'Создать на предприятии систему дополнительных льгот.\n' +
                'Повысить лояльность персонала к компании и мотивировать работников на достижение плана',
            price: 30000,
            skills: {
                'Кадровый учет': 1,
                'Составление трудовых договоров': 1,
                'Кадровое делопроизводство': 1,
                'Мотивация сотрудников': 1,
                'Оценка сотрудников': 1,
                'Выстраивание внутренних коммуникаций': 1,
                'Управление корпоративной культурой': 1,
                'Развитие сотрудников': 1,
                'Адаптация сотрудников': 1,
                'Активный поиск сотрудников': 1,
                'Холодный поиск сотрудников': 1,
                'Увольнение сотрудников': 1,
                'Аттестация персонала': 1
            },
            requirements: {}
        },
        {
            id: 4,
            platform: 'ТехноПрогресс',
            title: 'HR-менеджер. Подбор и управление персоналом',
            url: 'http://www.cpobr.ru/hr_menedzher_podbor_i_upravlenie_personalom/',
            format: ['Вебинар', 'Очная'],
            hasTeacher: true,
            hasPractice: false,
            certificate: 'Государственного образца',
            city: 'Москва',
            duration: 48,
            durationUnits: 'ак. час',
            description: 'Эффективность предприятия или организации любого рода деятельности прежде всего зависит от слаженной работы коллектива. Наши курсы по подбору персонала направлены на обучение грамотному и продуманному развитию кадрового потенциала компании.  \n' +
                '\n' +
                'Во время учебы слушатели ознакомятся как с теорией, так и с практикой: каждый этап обучения включает в себя интересные задачи, деловые игры, кейсы, моделирование ситуаций, которые действительно могут происходит в трудовой деятельности HR-менеджера.\n' +
                '\n' +
                'Курсы управления персоналом в нашем Центре профессионального образования «ТехноПрогресс» ведут компетентные специалисты, имеющие внушительный стаж работы на руководящих должностях в таких компаниях, как Nestle Rus, Coca-Cola HBC Russia, Центр экспертизы по вопросам трудового права и управления трудовыми отношениями и др. Они на каждой лекции рассматривают только важные вопросы: актуальные задачи, типичные ошибки и продуктивные решения для HR-менеджеров.\n' +
                '\n' +
                'Слушатели познакомятся с уникальным опытом наших педагогов, получат презентационные материалы по каждому модулю, а также информативные методические пособия: образцы документов для работы службы персонала; памятки; листы оценки; тесты; образцы бланков; примеры процедур; шаблоны договоров и планов и пр.\n' +
                '\n' +
                'Если вы хотите в совершенстве владеть навыками в сфере подбора и управления персоналом – приглашаем вас на курсы HR-менеджеров в Центр профессионального образования «ТехноПрогресс»!\n' +
                '\n' +
                'По окончании занятий слушателям выдается документ о повышении квалификации',
            price: 17470,
            skills: {
                'Выстраивание HR-процессов': 1,
                'Составление должностных инструкций': 1,
                'Оценка сотрудников': 1,
                'Мотивация сотрудников': 1,
                'Системы KPI': 1,
                'Программы стимулирования персонала': 1,
                'Управление корпоративной культурой': 1,
                'Кадровое планирование': 1,
                'Адаптация сотрудников': 1,
                'Активный поиск сотрудников': 1,
                'Холодный поиск сотрудников': 1,
                'Оценка сотрудников': 1,
                'Развитие сотрудников': 1,
                'Системы KPI': 1,
                'Кадровое планирование': 1
            },
            requirements: {}
        },
        {
            id: 5,
            platform: 'Русская Школа Управления',
            title: 'Кадровое планирование и бюджетирование',
            url: 'https://uprav.ru/kursy-upravleniya-personalom/kadrovoe-planirovanie-i-byudzhetirovanie/',
            format: 'Очная',
            hasTeacher: true,
            hasPractice: true,
            certificate: 'Государственного образца',
            city: 'Москва',
            duration: 16,
            durationUnits: 'ак. час',
            description: 'Определение размера средств, выделяемых на персонал, позволит оптимизировать расходы компании и повысит ее прибыльность. При этом необдуманное «урезание» бюджета приведет к резкому снижению эффективности и производительности труда. Соблюсти верный баланс в работе помогут курсы кадрового планирования от РШУ. На них изучаются важнейшие тренды и опыт передовых компаний в распределении бюджета. Слушатели научатся планировать потребность в персонале, рассчитывать его оптимальную численность. На семинаре по кадровому бюджетированию сравнивается традиционный наем и аутсорсинг, их возможности и сложности.\n' +
                '\n' +
                'Наши программы всегда ориентированы на практический результат. На тренингах по бюджетированию персонала аудитория выполняет задание по оптимизации затрат, максимально приближенное к реальности. Также слушатели получают хорошо структурированные теоретические знания о базовых элементах расходов на персонал. Регулярное обучение для кадрового планирования ? залог успешной защиты бюджетов при взаимодействии с дирекцией, умения контролировать расходы и прогнозировать их. Наши программы позволят повысить отдачу от работы и собственную ценность.',
            price: 26500,
            skills: {
                'Кадровая аналитика и статистика': 2,
                'Бюджетирование': 2,
                'Выстраивание HR-процессов': 2,
                'Кадровое планирование': 2
            },
            requirements: {
                'Кадровая аналитика и статистика': 1,
                'Бюджетирование': 1,
                'Выстраивание HR-процессов': 1,
                'Кадровое планирование': 1
            }
        },
        {
            id: 6,
            platform: 'Русская Школа Управления',
            title: 'Курс повышения квалификации директора по персоналу',
            url: 'https://uprav.ru/kursy-upravleniya-personalom/direktor-po-personalu/',
            format: 'Очная',
            hasTeacher: true,
            hasPractice: true,
            certificate: 'Государственного образца',
            city: 'Москва',
            duration: 5,
            durationUnits: 'день',
            description: 'Русская Школа Управления приглашает на авторский курс «Директор по персоналу». На семинарах затрагиваются наиболее актуальные вопросы, касающиеся управления человеческими ресурсами. На курсах для директоров по персоналу будут рассмотрены:\n' +
                '\n' +
                'принципы формирования продуктивной кадровой службы;\n' +
                'методики отбора кандидатов;\n' +
                'способы мотивации работников;\n' +
                'пути создания, поддержания и развития корпоративной культуры и так далее.\n' +
                'Для любого директора курс РШУ также станет трамплином для развития личностных управленческих навыков.\n' +
                '\n' +
                ' \n' +
                '\n' +
                'Кого заинтересует курс «Директор по персоналу»?\n' +
                '\n' +
                ' \n' +
                '\n' +
                'Курсы по специальности «Директор по персоналу» будут интересны:\n' +
                '\n' +
                'начальникам отдела кадров;\n' +
                'сотрудникам кадровых служб;\n' +
                'HR-менеджерам;\n' +
                'начальникам отделов, занимающихся управлением персоналом.\n' +
                'Каждому директору курс РШУ даст ценные знания, которые будут подкреплены документом государственного образца, свидетельствующим о получении профессионального образования в сфере управления персоналом',
            price: 55500,
            skills: {
                'Кадровая аналитика и статистика': 2,
                'Бюджетирование': 2,
                'Выстраивание HR-процессов': 2,
                'Кадровое планирование': 2,
                'Кадровое делопроизводство': 1,
                'Оценка сотрудников': 1,
                'Программы адаптации персонала': 1,
                'Аттестация персонала': 1,
                'Программы отбора персонала': 1,
                'Программы привлечения персонала': 1,
                'Программы развития персонала': 1,
                'Система грейдов': 2,
                'Мотивация сотрудников': 1,
                'Системы KPI': 2,
                'Выстраивание внутренних коммуникаций': 1,
                'Управление изменениями': 2,
                'Формирование HR-бренда': 1
            },
            requirements: {
                'Кадровая аналитика и статистика': 1,
                'Бюджетирование': 1,
                'Выстраивание HR-процессов': 1,
                'Кадровое планирование': 1
            }
        },
        {
            id: 6.5,
            platform: 'Русская Школа Управления',
            title: 'Курс повышения квалификации директора по персоналу',
            url: 'https://uprav.ru/kursy-upravleniya-personalom/1350777622/',
            format: 'Онлайн',
            hasTeacher: true,
            hasPractice: true,
            certificate: 'Государственного образца',
            city: 'Москва',
            duration: 5,
            durationUnits: 'день',
            description: 'Русская Школа Управления приглашает на авторский курс «Директор по персоналу». На семинарах затрагиваются наиболее актуальные вопросы, касающиеся управления человеческими ресурсами. На курсах для директоров по персоналу будут рассмотрены:\n' +
                '\n' +
                'принципы формирования продуктивной кадровой службы;\n' +
                'методики отбора кандидатов;\n' +
                'способы мотивации работников;\n' +
                'пути создания, поддержания и развития корпоративной культуры и так далее.\n' +
                'Для любого директора курс РШУ также станет трамплином для развития личностных управленческих навыков.\n' +
                '\n' +
                ' \n' +
                '\n' +
                'Кого заинтересует курс «Директор по персоналу»?\n' +
                '\n' +
                ' \n' +
                '\n' +
                'Курсы по специальности «Директор по персоналу» будут интересны:\n' +
                '\n' +
                'начальникам отдела кадров;\n' +
                'сотрудникам кадровых служб;\n' +
                'HR-менеджерам;\n' +
                'начальникам отделов, занимающихся управлением персоналом.\n' +
                'Каждому директору курс РШУ даст ценные знания, которые будут подкреплены документом государственного образца, свидетельствующим о получении профессионального образования в сфере управления персоналом',
            price: 55500,
            skills: {
                'Кадровая аналитика и статистика': 2,
                'Бюджетирование': 2,
                'Выстраивание HR-процессов': 2,
                'Кадровое планирование': 2,
                'Кадровое делопроизводство': 1,
                'Оценка сотрудников': 1,
                'Программы адаптации персонала': 1,
                'Аттестация персонала': 1,
                'Программы отбора персонала': 1,
                'Программы привлечения персонала': 1,
                'Программы развития персонала': 1,
                'Система грейдов': 2,
                'Мотивация сотрудников': 1,
                'Системы KPI': 2,
                'Выстраивание внутренних коммуникаций': 1,
                'Управление изменениями': 2,
                'Формирование HR-бренда': 1
            },
            requirements: {
                'Кадровая аналитика и статистика': 1,
                'Бюджетирование': 1,
                'Выстраивание HR-процессов': 1,
                'Кадровое планирование': 1
            }
        },
        {
            id: 7,
            platform: 'Русская Школа Управления',
            title: 'Специалист отдела кадров. Практический курс',
            url: 'https://uprav.ru/kursy-upravleniya-personalom/spetsialist-otdela-kadrov-prakticheskiy-kurs/',
            format: 'Очная',
            hasTeacher: true,
            hasPractice: true,
            certificate: 'Государственного образца',
            city: 'Москва',
            duration: 4,
            durationUnits: 'день',
            description: 'Отдел кадров – первое подразделение, с которым сталкивается человек, приходя на работу в компанию. От грамотной организации этого отдела и профессионализма его сотрудников зависит не только внутренний «климат», но подчас и конкурентоспособность предприятия. Правильное оформление трудовых отношений, разработка систем поощрения и мотивации, забота о здоровье персонала – вот лишь немногие компетенции сотрудника отдела кадров. Не зря сегодня особое внимание уделяется обучению специалистов по кадровым вопросам. Повышенным спросом пользуются курсы по документообороту предприятия и курсы кадрового делопроизводства.\n' +
                '\n' +
                'Русская Школа Управления представляет комплексную программу повышения квалификации кадровых работников. Мы проводим семинары по кадровому делу и делопроизводству в Москве и Санкт-Петербурге и приглашаем к участию\n' +
                '\n' +
                '    сотрудников и руководителей кадровых служб\n' +
                '    менеджеров по подбору персонала\n' +
                '    специалистов по контролю над документооборотом предприятия\n' +
                '    инспекторов отдела кадров\n' +
                '\n' +
                'Повышение квалификации специалистов по кадровому делопроизводству – одна из важнейших задач любого руководителя. В рамках нашего семинара проводится обучение кадровому учету и рассматривается множество вопросов, непосредственно связанных с соблюдением трудового законодательства',
            price: 47900,
            skills: {
                'Кадровое делопроизводство': 2,
                'Кадровый учет': 2,
                'Поиск сотрудников на массовые должности': 2,
                'Увольнение сотрудников': 2,
                'Составление должностных инструкций': 2,
                'Управление изменениями': 2
            },
            requirements: {
                'Кадровое делопроизводство': 1,
                'Кадровый учет': 1,
                'Поиск сотрудников на массовые должности': 1,
                'Увольнение сотрудников': 1,
                'Составление должностных инструкций': 1,
                'Управление изменениями': 1
            }
        },
        {
            id: 8,
            platform: 'Русская Школа Управления',
            title: 'Технологии массового рекрутмента',
            url: 'https://uprav.ru/kursy-upravleniya-personalom/tehnologii-massovogo-rekrutinga-distantsionnyy-kurs/',
            format: 'Вечерняя',
            hasTeacher: true,
            hasPractice: true,
            certificate: 'Государственного образца',
            city: 'Москва',
            duration: 24,
            durationUnits: 'ак. час',
            description: 'Планирование и организация процесса подбора персонала\n' +
                '\n' +
                'Разработка профиля вакансий, составление описаний вакансий\n' +
                'Анализ ситуации на рынке труда\n' +
                'Определение инструментов подбора персонала\n' +
                'Определение графика подбора персонала\n' +
                'Бюджетирование\n' +
                'Источники поиска персонала и рекламные инструменты\n' +
                '\n' +
                'Обзор основных источников поиска\n' +
                'Оценка их возможностей и ограничений\n' +
                'Критерии выбора источников для работы над проектом по подбору\n' +
                'Составление плана по работе с источниками\n' +
                'Анализ кейсов из различных отраслей бизнеса\n' +
                'Этапы отбора и оценки соискателей\n' +
                '\n' +
                'Организация анкетирования и тестирования\n' +
                'Проведение телефонных и скайп-интервью\n' +
                'Проведение групповых и индивидуальных очных собеседований\n' +
                'Проверка документов и процедура оформления на работу\n' +
                'Организация адаптации и обучения новых сотрудников\n' +
                'Специфика массового подбора в различных отраслях\n' +
                '\n' +
                'Ресторанный и гостиничный бизнес\n' +
                'Ритейл\n' +
                'Строительство\n' +
                'Производство\n' +
                'Транспорт/логистика/склад\n' +
                'Реклама и услуги',
            price: 9900,
            skills: {
                'Активный поиск сотрудников': 1,
                'Холодный поиск сотрудников': 1,
                'Поиск сотрудников на массовые должности': 1
            },
            requirements: {}
        },
        {
            id: 9,
            platform: 'Специалист',
            title: 'Специалист по зарплате и управлению персоналом в 1С: Предприятие 8',
            url: 'https://www.specialist.ru/track/t-1czuotch',
            format: ['Очная', 'Вечерняя', 'Выходные', 'Онлайн'],
            hasTeacher: true,
            hasPractice: true,
            certificate: 'Государственного образца',
            city: 'Москва',
            duration: 68,
            durationUnits: 'ак. час',
            description: 'Специалист по зарплате и управлению персоналом в 1С: Предприятие 8 (редакция 3.1) с разработкой отчетности \n' +
                'Включает в себя 3 курса:\n' +
                ' \t1С:Зарплата и Управление персоналом 8 (ред. 3.1). Уровень 1. Расчеты с персоналом и формирование отчетности\t\t \n' +
                ' \t1С:Зарплата и Управление персоналом 8 (ред. 3.1). Уровень 2. Расширенные возможности\n' +
                ' \t1С:Предприятие 8. Работа с отчетами в программе Зарплата и управление персоналом (редакция 3.1)',
            price: 24690,
            skills: {
                'Владение 1С ЗУП': 2
            },
            requirements: {
                'Кадровый учет': 1,
                'Трудовой кодекс РФ': 1
            }
        },
        {
            id: 10,
            platform: 'Специалист',
            title: 'Менеджер по персоналу со знанием кадрового дела и 1С (HR - generalist)',
            url: 'https://www.specialist.ru/track/t-mper1c',
            format: ['Очная', 'Вечерняя', 'Выходные', 'Онлайн'],
            hasTeacher: true,
            hasPractice: true,
            certificate: 'Государственного образца',
            city: 'Москва',
            duration: 96,
            durationUnits: 'ак. час',
            description: 'Комплексная программа подготовки менеджера по персоналу включает в себя фундаментальные вопросы управления персоналом и затрагивает практические аспекты использования современных ИТ-решений HR-подразделений.\n' +
                '\n' +
                'От HR-служб в современных организациях зависит очень многое. Например, мотивированы ли сотрудники в компании. Менеджеры по персоналу разрабатывают методики обучения и развития персонала, готовят кадровые резервы. На курсах Вы научитесь вести кадровые документы и оформлять трудовые отношения с учетом требований российского законодательства.\n' +
                '\n' +
                'Учебную программу читают профессиональные преподаватели-практики. Обучение слушателей ведется в интерактивной форме. На лекциях даются необходимые знания и навыки работы менеджеров по персоналу. На реальных задачах Вы узнаете, как вести кадровый учет в системе 1С, настраивать кадровые политики, составлять графики работы и штатное расписание.\n' +
                '\n' +
                'Станьте HR-профессионалом, пройдите обучение по комплексной программе «Менеджер по персоналу со знанием кадрового дела и 1С» центре «Специалист»!',
            price: 31690,
            skills: {
                'Кадровое делопроизводство': 1,
                'Кадровый учет': 1,
                'Увольнение сотрудников': 1,
                'Аттестация персонала': 1,
                'Трудовой кодекс РФ': 1,
                'Адаптация сотрудников': 1,
                'Оценка сотрудников': 1,
                'Развитие сотрудников': 1,
                'Программы стимулирования персонала': 1,
                'Программы развития персонала': 1,
                'Владение 1С ЗУП': 1
            },
            requirements: {}
        },
        {
            id: 11,
            platform: 'HR-Академия',
            title: 'Менеджер по подбору и адаптации персонала (рекрутер)',
            url: 'https://hr-academy.ru/podbor-adaptatsiya-personala',
            format: 'Онлайн',
            hasTeacher: true,
            hasPractice: true,
            certificate: 'Собственный',
            city: 'Москва',
            duration: 18,
            durationUnits: 'урок',
            description: 'УРОК 1. ВВЕДЕНИЕ В ПРОФЕССИЮ МЕНЕДЖЕРА ПО ПОДБОРУ ПЕРСОНАЛА\n' +
                'Все, что вы хотели знать о форме, содержании курса и о технологии обучения. 16 ключевых знаний и навыков рекрутера, которые вы получите.\n' +
                'УРОК 2. ЗАЯВКА НА ПОДБОР\n' +
                'Учимся составлять текст объявления о вакансии, делаем так, чтобы ее легко было найти, придумываем креативные рекрутинговые акции!\n' +
                'УРОК 3. ТРЕБОВАНИЯ К ПОЗИЦИИ (ПРОФИЛИ КАНДИДАТОВ)\n' +
                'Составляем требования к профессиональным и личным качествам.\n' +
                'Рассматриваем бизнес-процесс подбора: алгоритм действий, участники и согласования',
            price: 16600,
            skills: {
                'Адаптация сотрудников': 1,
                'Активный поиск сотрудников': 1,
                'Холодный поиск сотрудников': 1,
                'Оценка сотрудников': 1,
                'Проведение собеседований': 1,
                'Проведение телефонных интервью': 1,
                'Программы адаптации персонала': 1
            },
            requirements: {}
        },
        {
            id: 12,
            platform: 'HR-Академия',
            title: 'Менеджер по подбору и адаптации персонала (рекрутер)',
            url: 'https://hr-academy.ru/podbor-adaptatsiya-personala',
            format: 'Онлайн',
            hasTeacher: false,
            hasPractice: false,
            certificate: 'Собственный',
            city: 'Москва',
            duration: 18,
            durationUnits: 'урок',
            description: 'УРОК 1. ВВЕДЕНИЕ В ПРОФЕССИЮ МЕНЕДЖЕРА ПО ПОДБОРУ ПЕРСОНАЛА\n' +
                'Все, что вы хотели знать о форме, содержании курса и о технологии обучения. 16 ключевых знаний и навыков рекрутера, которые вы получите.\n' +
                'УРОК 2. ЗАЯВКА НА ПОДБОР\n' +
                'Учимся составлять текст объявления о вакансии, делаем так, чтобы ее легко было найти, придумываем креативные рекрутинговые акции!\n' +
                'УРОК 3. ТРЕБОВАНИЯ К ПОЗИЦИИ (ПРОФИЛИ КАНДИДАТОВ)\n' +
                'Составляем требования к профессиональным и личным качествам.\n' +
                'Рассматриваем бизнес-процесс подбора: алгоритм действий, участники и согласования',
            price: 3200,
            skills: {
                'Мотивация сотрудников': 1,
                'Выстраивание внутренних коммуникаций': 1,
                'Модерация и фасилитация дискуссий': 1,
                'Управление корпоративной культурой': 1
            },
            requirements: {}
        },
        {
            id: 13,
            platform: 'HR-Академия',
            title: 'Менеджер по внутренним коммуникациям (PR- и Event-менеджер)',
            url: 'https://hr-academy.ru/vnutrennie-kommunikacii',
            format: 'Онлайн',
            hasTeacher: true,
            hasPractice: true,
            certificate: 'Собственный',
            city: 'Москва',
            duration: 18,
            durationUnits: 'урок',
            description: 'УРОК 1. ВВЕДЕНИЕ В ПРОФЕССИЮ МЕНЕДЖЕР ПО ВНУТРИКОРПОРАТИВНЫМ КОММУНИКАЦИЯМ (PR и EVENT-менеджер)\n' +
                'Форма и содержание курса, график занятий, выполнение заданий.\n' +
                'Список того, чему вы научитесь. Как хорошая система коммуникаций влияет на производительность компании.\n' +
                'УРОК 2. КОРПОРАТИВНАЯ КУЛЬТУРА И КОРПОРАТИВНЫЕ КОММУНИКАЦИИ\n' +
                'Разбираемся с понятиями. Внутрикорпоративный PR, его каналы и инструменты. Приступаем к исследованию культуры компании и оценке качества внутренних коммуникаций.\n' +
                'УРОК 3. РАЗРАБОТКА КОММУНИКАЦИОННОЙ СТРАТЕГИИ\n' +
                'Шесть шагов построения эффективной системы внутренних коммуникаций.\n' +
                'Настаиваем на разработке директорами видения, миссии и ценностей компании',
            price: 16600,
            skills: {
                'Адаптация сотрудников': 1,
                'Активный поиск сотрудников': 1,
                'Холодный поиск сотрудников': 1,
                'Оценка сотрудников': 1,
                'Проведение собеседований': 1,
                'Проведение телефонных интервью': 1,
                'Программы адаптации персонала': 1
            },
            requirements: {
                'Мотивация сотрудников': 1,
                'Выстраивание внутренних коммуникаций': 1,
                'Модерация и фасилитация дискуссий': 1,
                'Управление корпоративной культурой': 1
            }
        },
        {
            id: 14,
            platform: 'HR-Академия',
            title: 'Менеджер по внутренним коммуникациям (PR- и Event-менеджер)',
            url: 'https://hr-academy.ru/vnutrennie-kommunikacii',
            format: 'Онлайн',
            hasTeacher: false,
            hasPractice: false,
            certificate: 'Собственный',
            city: 'Москва',
            duration: 18,
            durationUnits: 'урок',
            description: 'УРОК 1. ВВЕДЕНИЕ В ПРОФЕССИЮ МЕНЕДЖЕР ПО ВНУТРИКОРПОРАТИВНЫМ КОММУНИКАЦИЯМ (PR и EVENT-менеджер)\n' +
                'Форма и содержание курса, график занятий, выполнение заданий.\n' +
                'Список того, чему вы научитесь. Как хорошая система коммуникаций влияет на производительность компании.\n' +
                'УРОК 2. КОРПОРАТИВНАЯ КУЛЬТУРА И КОРПОРАТИВНЫЕ КОММУНИКАЦИИ\n' +
                'Разбираемся с понятиями. Внутрикорпоративный PR, его каналы и инструменты. Приступаем к исследованию культуры компании и оценке качества внутренних коммуникаций.\n' +
                'УРОК 3. РАЗРАБОТКА КОММУНИКАЦИОННОЙ СТРАТЕГИИ\n' +
                'Шесть шагов построения эффективной системы внутренних коммуникаций.\n' +
                'Настаиваем на разработке директорами видения, миссии и ценностей компании.',
            price: 3200,
            skills: {
                'Мотивация сотрудников': 1,
                'Выстраивание внутренних коммуникаций': 1,
                'Модерация и фасилитация дискуссий': 1,
                'Управление корпоративной культурой': 1
            },
            requirements: {}
        },
        {
            id: 15,
            platform: 'Moscow Business School',
            title: 'Практикум по кадровому планированию и бюджетированию',
            url: 'https://mbschool.ru/seminars/7454',
            format: 'Очная',
            hasTeacher: true,
            hasPractice: false,
            certificate: 'Собственный',
            city: 'Москва',
            duration: 1,
            durationUnits: 'день',
            description: 'Кадровое планирование помогает определить качественную и количественную потребность в сотрудниках различных категорий, а также соответствие структурного и кадрового потенциала компании ее целям и стратегии развития. В свою очередь, кадровое бюджетирование дает возможность грамотно вести бюджет расходов на персонал, контролировать затраты и анализировать расходы.\n' +
                '\n' +
                'Экономический эффект от кадрового планирования и бюджетирования трудно переоценить. Он выражается в сокращении возможных потерь на ввод новых сотрудников; минимизации затрат на поиск и подбор персонала; снижении потерь и ущерба, вызванных несоответствием кандидата должности; уменьшении текучести кадров.',
            price: 13400,
            skills: {
                'Кадровое планирование': 1,
                'Бюджетирование': 1
            },
            requirements: {
                'Кадровый учет': 2
            }
        },
        {
            id: 16,
            platform: 'Нетология',
            title: 'Разработка системы KPI',
            url: 'https://netology.ru/courses/razrabotka-sistemy-kpi',
            format: 'Интерактивный',
            hasTeacher: false,
            hasPractice: false,
            certificate: 'Нет',
            city: 'Москва',
            duration: 35,
            durationUnits: 'минута',
            description: 'Увеличить прибыль компании на 4% можно с помощью грамотно внедренной системы KPI. Она позволяет контролировать работу каждого сотрудника и ставить перед ним конкретные цели. Но немногие руководители знают, как разработать систему оценки эффективности для нужд конкретной компании.\n' +
                '\n' +
                'Курс ориентирован на менеджеров по управлению персоналом, HR-директоров, топ-менеджеров, руководителей и владельцев бизнеса.\n' +
                '\n' +
                'Василий Проша расскажет, что представляет собой система KPI, в каких случаях ее стоит разрабатывать и внедрять. Вы научитесь определять цели компании и формировать перечень KPI для разных должностей. Вы узнаете, какие «подводные камни» могут возникнуть во время внедрения системы оценки эффективности и как их избежать',
            price: 490,
            skills: {
                'Системы KPI': 1
            },
            requirements: {}
        },
        {
            id: 17,
            platform: 'Нетология',
            title: 'Бесконфликтное увольнение персонала',
            url: 'https://netology.ru/courses/beskonfliktnoe-uvolnenie-personala',
            format: 'Интерактивный',
            hasTeacher: false,
            hasPractice: false,
            certificate: 'Нет',
            city: 'Москва',
            duration: 70,
            durationUnits: 'минута',
            description: 'Многие компании гордятся дружным коллективом. Однако порой возникает необходимость расстаться с одним из сотрудников. В такой момент руководители зачастую сталкиваются с проблемой: как остаться в хороших отношениях с уходящим коллегой и не демотивировать команду новостью об увольнении?\n' +
                '\n' +
                'Этот курс будет полезен топ-менеджерам, руководителям компаний и HR-специалистам, которые хотят избежать ошибок при увольнении сотрудников.\n' +
                '\n' +
                'Инга Орлова расскажет, как выстроить беседу с увольняемым, помочь ему с дальнейшим трудоустройством и сообщить новость коллективу. Вы узнаете, как правильно хвалить и критиковать при увольнении, и научитесь проводить выходное интервью',
            price: 490,
            skills: {
                'Увольнение сотрудников': 1
            },
            requirements: {}
        },
        {
            id: 18,
            platform: 'Нетология',
            title: 'Материальная и нематериальная мотивация сотрудников',
            url: 'https://netology.ru/courses/materialnaya-i-nematerialnaya-motivaciya',
            format: 'Интерактивный',
            hasTeacher: false,
            hasPractice: false,
            certificate: 'Нет',
            city: 'Москва',
            duration: 27,
            durationUnits: 'минута',
            description: 'Сотрудник, увлеченный делом, работает более эффективно. Но как быть, если задача не вызывает у него интереса и желания достичь высоких результатов? Как настроить специалиста на продуктивную работу?\n' +
                '\n' +
                'Этот курс будет полезен HR-специалистам и руководителям подразделений, а также директорам и владельцам бизнеса, которые уверены, что правильно мотивированные специалисты — важная составляющая успеха.\n' +
                '\n' +
                'На курсе вы узнаете, какие виды мотивации существуют и в каких ситуациях использовать каждый из них, как понять, чем заинтересовать сотрудника, и как мотивация поможет раскрыть его потенциал',
            price: 490,
            skills: {
                'Мотивация сотрудников': 1
            },
            requirements: {}
        },
        {
            id: 19,
            platform: 'Нетология',
            title: 'Методы развития и обучения сотрудников',
            url: 'https://netology.ru/courses/metodi-razvitiya-i-obucheniya-personala',
            format: 'Интерактивный',
            hasTeacher: false,
            hasPractice: false,
            certificate: 'Нет',
            city: 'Москва',
            duration: 92,
            durationUnits: 'минута',
            description: 'Недостаточная квалификация сотрудников, постоянная текучка и низкая продуктивность. Как с этим бороться? Вместо того чтобы брать лишнюю работу на себя, займитесь обучением персонала. Это намного продуктивнее, чем надеяться на поиск идеального сотрудника.  \n' +
                '\n' +
                'На курсе вы узнаете, какие способы обучения для каких целей использовать, научитесь минимизировать расходы на тренинги и откроете преимущества пассивного обучения. Автор курса расскажет, как бесплатно обучить наставника и сэкономить средства на найме коучей.\n' +
                '\n' +
                'Самостоятельный и квалифицированный сотрудник сбережет ваше время и повысит прибыль',
            price: 490,
            skills: {
                'Развитие сотрудников': 1
            },
            requirements: {}
        },
        {
            id: 20,
            platform: 'Нетология',
            title: 'Как оценить кандидатов и сотрудников: построение кадровой политики',
            url: 'https://netology.ru/courses/kak-otsenit-kandidatov-i-sotrudnikov-postroenie-kadrovoi-politiki',
            format: 'Интерактивный',
            hasTeacher: false,
            hasPractice: false,
            certificate: 'Нет',
            city: 'Москва',
            duration: 118,
            durationUnits: 'минута',
            description: 'Неправильно подобранный сотрудник будет всегда недоволен работой и зарплатой, вряд ли когда-то раскроет свой потенциал и никогда не покажет выдающиеся результаты. Случается и так, что прекрасный сотрудник со временем выгорает и теряет интерес к общему делу.\n' +
                '\n' +
                'Как избежать всех этих кадровых неприятностей? На курсе вы выстроите эффективную систему оценки кандидатов, узнаете, как правильно проводить собеседования, и научитесь всегда держать в тонусе свою команду.\n' +
                '\n' +
                'Вы сможете выстраивать кадровую политику так, чтобы каждый сотрудник компании был на своем месте и работал на результат',
            price: 490,
            skills: {
                'Оценка сотрудников': 1,
                'Проведение собеседований': 1,
                'Мотивация сотрудников': 1,
                'Разработка кадровых политик': 1
            },
            requirements: {}
        },
        {
            id: 21,
            platform: 'Нетология',
            title: 'Технология подбора персонала',
            url: 'https://netology.ru/courses/tehnologiya-podbora-personala',
            format: 'Интерактивный',
            hasTeacher: false,
            hasPractice: false,
            certificate: 'Нет',
            city: 'Москва',
            duration: 166,
            durationUnits: 'минута',
            description: 'Подолгу ищете новых сотрудников и не всегда довольны конечным результатом? Скорее всего, вы используете не самые эффективные способы подбора и не знаете обо всех кадровых инструментах.\n' +
                '\n' +
                'На курсе вы поймете, как организовать поиск кандидатов, сможете составить HR-стратегию, прочитать между строк любое резюме, оценить персонал и правильно провести интервью.\n' +
                '\n' +
                'С помощью курса вы станете быстрее закрывать вакансии и находить наиболее подходящих сотрудников для решения задач компании',
            price: 490,
            skills: {
                'Активный поиск сотрудников': 1,
                'Холодный поиск сотрудников': 1,
                'Оценка сотрудников': 1,
                'Проведение собеседований': 1
            },
            requirements: {}
        },
        {
            id: 22,
            platform: 'Нетология',
            title: 'HR-брендинг как инструмент привлечения и удержания сотрудников',
            url: 'https://netology.ru/courses/hr-brending-kak-instrument-privlecheniya-i-uderzhaniya-sotrudnikov',
            format: 'Интерактивный',
            hasTeacher: false,
            hasPractice: false,
            certificate: 'Нет',
            city: 'Москва',
            duration: 134,
            durationUnits: 'минута',
            description: 'HR-бренд - это то, что поможет сделать вашу компанию привлекательной как для потенциальных сотрудников, так и для тех, кто уже работает с вами. Вы сэкономите время и ресурсы на поиске, найме и удержании персонала, если будете задумываться о позиционировании HR-бренда компании. Чтобы достичь этой цели, существует масса инструментов. Кто-то проходит курс по созданию landing page и использует полученные навыки для привлечения потенциальных сотрудников посредством этого инструмента. Другие вместо лендинг пейдж проходят обучение по HR-специализациям и учатся применять методики, ориентированные на непосредственную работу с людьми. О том, с чего следует начать, как делать яркие landing page под отдельные вакансии, по каким алгоритмам следует продвигать HR-бренд с нуля, и как избежать возможных ошибок расскажет эксперт в данной сфере, руководитель консалтингового центра HeadHunter Group Елена Русанова',
            price: 490,
            skills: {
                'Формирование HR-бренда': 1,
                'Кадровая аналитика и статистика': 1
            },
            requirements: {}
        },
        {
            id: 23,
            platform: 'Нетология',
            title: 'Очный мастер-класс по HR-копирайтингу: как создать правильное описание вакансий',
            url: 'https://netology.ru/programs/hr-copywriting',
            format: 'Интенсив',
            hasTeacher: true,
            hasPractice: true,
            certificate: 'Нет',
            city: 'Москва',
            duration: 2,
            durationUnits: 'день',
            description: 'Чему вы научитесь на курсе\n' +
                '\n' +
                'Как описывать вакансии самому, без копирайтера. Вы сможете запустить вакансию в тот же день, когда в ней возникла потребность.\n' +
                '\n' +
                'Отличать хорошие и плохие описания и выделять работающие принципы. После курса вы получите навыки редактора и будете писать легче.\n' +
                '\n' +
                'Описывать вакансии хорошо и повышать результативность поисков. Мы посмотрим на ваши вакансии и вместе улучшим их',
            price: 9990,
            skills: {
                'Холодный поиск сотрудников': 1,
                'Использование социальных инструментов подбора': 1
            },
            requirements: {}
        },
        {
            id: 24,
            platform: 'Нетология',
            title: 'Очный мастер-класс по хедхантингу: технология и практика охоты за головам',
            url: 'https://netology.ru/programs/headhunting',
            format: 'Интенсив',
            hasTeacher: true,
            hasPractice: true,
            certificate: 'Нет',
            city: 'Москва',
            duration: 2,
            durationUnits: 'день',
            description: 'Хэдхантинг — это способ максимально быстро повысить продуктивность бизнеса или в корне изменить его направление. Отбросим все сомнения и разберемся в тонкостях этого процесса. Отработаем полученные знания на практике и, возможно, кого-то схантим уже в эти два дня',
            price: 9990,
            skills: {
                'Активный поиск сотрудников': 1,
                'Поиск IT сотрудников': 1
            },
            requirements: {}
        },
        {
            id: 25,
            platform: 'Нетология',
            title: 'Очный мастер-класс по таргетированной рекламе для рекрутеров',
            url: 'https://netology.ru/programs/hr-targeting',
            format: 'Интенсив',
            hasTeacher: true,
            hasPractice: true,
            certificate: 'Нет',
            city: 'Москва',
            duration: 2,
            durationUnits: 'день',
            description: 'Рассмотрим основы маркетинга для рекрутера, поговорим о стратегии продвижения вакансии в социальных сетях сетях (Facebook, Вконтакте, Одноклассники). Рассмотрим воронки продаж для HR. Научимся готовить и распространять объявления о вакансиях в социальных сетях так, чтобы они работали. Обсудим инструменты как для закрытия массовых вакансий, так и для точечного подбора.\n' +
                'Разберем логику и принципы работы таргетированной рекламы. Сделаем обзор инструментов таргетированной рекламы и принципов их применения. Большую часть второго дня мастер-класса посвятим практике. Разберем интерфейс сервиса myTarget. Освоим методику подбора целевой аудитории. Под руководством преподавателя создадим собственную рекламную кампанию под свои рабочие цели.',
            price: 9990,
            skills: {
                'Холодный поиск сотрудников': 1,
                'Использование социальных инструментов подбора': 1
            },
            requirements: {}
        },
        {
            id: 26,
            platform: 'Нетология',
            title: 'Рекрутмент: инструменты и алгоритмы поиска идеальных кандидатов',
            url: 'https://netology.ru/programs/recruitment',
            format: 'Онлайн',
            hasTeacher: true,
            hasPractice: true,
            certificate: 'Государственного образца',
            city: 'Москва',
            duration: 2,
            durationUnits: 'месяц',
            description: 'На курсе вы научитесь\n' +
                '\n' +
                'Готовиться к началу работы\n' +
                'Настраивать рабочее пространство и повышать эффективность работы\n' +
                'с помощью автоматизации подбора\n' +
                '\n' +
                'Общаться с заказчиком и выявлять его требования\n' +
                'Правильно снимать вакансию, создавать чек-листы для максимально быстрого получения результатов\n' +
                '\n' +
                'Использовать современные инструменты\n' +
                'Применять в работе Boolean-запросы, X-Ray, парсеры резюме и другие инструменты поиска\n' +
                '\n' +
                'Проводить технические интервью\n' +
                'Готовиться к техническому собеседованию и составлять техническое задание\n' +
                '\n' +
                'Адаптировать новых сотрудников\n' +
                'Создавать персонализированные офферы, готовить рабочее место\n' +
                'и настраивать эффективный процесс адаптации',
            price: 19900,
            skills: {
                'Поиск IT сотрудников': 1,
                'Выстраивание HR-процессов': 1,
                'Адаптация сотрудников': 1,
                'Активный поиск сотрудников': 1,
                'Холодный поиск сотрудников': 1,
                'Оценка сотрудников': 1,
                'Проведение собеседований': 1,
                'Использование социальных инструментов подбора': 1
            },
            requirements: {}
        },
        {
            id: 27,
            platform: 'Eduson',
            title: 'Как эффективно провести собеседование',
            url: 'https://www.eduson.tv/ru/courses/100',
            format: 'Интерактивный',
            hasTeacher: false,
            hasPractice: false,
            certificate: 'Нет',
            city: 'Москва',
            duration: 19,
            durationUnits: 'минута',
            description: 'Вы научитесь\n' +
                'Минимизировать риски при выборе кандидата на должность' +
                'Успешно проводить собеседования\n' +
                'Создавать профиль подходящего кандидата' +
                'Выбирать лучшего кандидата на должность',
            price: 605,
            skills: {
                'Проведение собеседований': 1
            },
            requirements: {}
        },
        {
            id: 28,
            platform: 'Coursera',
            title: '«Ловцы человеков» или социальные сети в медиа, бизнесе, рекрутинге и образовании',
            url: 'https://www.coursera.org/learn/sotsialnaya-set',
            format: 'Интерактивный',
            hasTeacher: true,
            hasPractice: true,
            certificate: 'Собственный',
            city: 'Томск',
            duration: 9,
            durationUnits: 'неделя',
            description: 'Мир сильно изменился с тех времен, когда люди общались между собою с помощью писем на бумаге и с помощью голоса, теперь все мы, расставляем кому-то сети отношений и попадаем в них сами, все мы отныне живем в Сети Глобальной паутины.\n' +
                'В этом новом мире сетей старые приемы налаживания отношений не работают: журналистов печатных изданий не читают в бумажном варианте, маркетологи, делающие ставку только на офлайн-работу, разоряют компании, пиарщики и рекламисты лишаются офлайн-аудитории, HR-специалист, не умеющий работать в сетях, не получает достоверной информации о своих кандидатах.\n' +
                'Единственный выход для профессионала: идти в Сеть, «ищите и обрящете»!\n' +
                '\n' +
                'Наш курс поможет вам узнать:\n' +
                '1.\tКакие сети существуют и как меняется психология «человека виртуально-сетевого».\n' +
                '2.\tПочему блоггеры испытывают от своей деятельности блОженство и что такое гражданская журналистика.\n' +
                '3.\tКак работает френд-бизнес и как компании делают из потребителей союзников, советчиков и сотрудников.\n' +
                '4.\tКак найти работу или работника в Сети.\n' +
                '5.\tКак организовать виртуальную вечеринку или виртуальный конкурс.',
            price: 1798,
            skills: {
                'Активный поиск сотрудников': 1,
                'Использование социальных инструментов подбора': 1
            },
            requirements: {}
        },
        {
            id: 29,
            platform: 'Coursera',
            title: '«Ловцы человеков» или социальные сети в медиа, бизнесе, рекрутинге и образовании',
            url: 'https://www.coursera.org/learn/sotsialnaya-set',
            format: 'Интерактивный',
            hasTeacher: false,
            hasPractice: false,
            certificate: 'Нет',
            city: 'Томск',
            duration: 9,
            durationUnits: 'неделя',
            description: 'Мир сильно изменился с тех времен, когда люди общались между собою с помощью писем на бумаге и с помощью голоса, теперь все мы, расставляем кому-то сети отношений и попадаем в них сами, все мы отныне живем в Сети Глобальной паутины.\n' +
                'В этом новом мире сетей старые приемы налаживания отношений не работают: журналистов печатных изданий не читают в бумажном варианте, маркетологи, делающие ставку только на офлайн-работу, разоряют компании, пиарщики и рекламисты лишаются офлайн-аудитории, HR-специалист, не умеющий работать в сетях, не получает достоверной информации о своих кандидатах.\n' +
                'Единственный выход для профессионала: идти в Сеть, «ищите и обрящете»!\n' +
                '\n' +
                'Наш курс поможет вам узнать:\n' +
                '1.\tКакие сети существуют и как меняется психология «человека виртуально-сетевого».\n' +
                '2.\tПочему блоггеры испытывают от своей деятельности блОженство и что такое гражданская журналистика.\n' +
                '3.\tКак работает френд-бизнес и как компании делают из потребителей союзников, советчиков и сотрудников.\n' +
                '4.\tКак найти работу или работника в Сети.\n' +
                '5.\tКак организовать виртуальную вечеринку или виртуальный конкурс.',
            price: 1798,
            skills: {
                'Активный поиск сотрудников': 1,
                'Использование социальных инструментов подбора': 1
            },
            requirements: {}
        },
        {
            id: 30,
            platform: 'YouTube',
            title: 'Курс для HR. "Проективная оценка персонала"',
            url: 'https://www.youtube.com/watch?v=abnwSQjPbXA',
            format: 'Видео',
            hasTeacher: false,
            hasPractice: false,
            certificate: 'Нет',
            city: '-',
            duration: 60,
            durationUnits: 'минута',
            description: 'Графология как метод проективной оценки персонала.\n' +
                '\n' +
                'В уроке: \n' +
                '1. Значимые школы в графологии.\n' +
                '2. Правила подачи почерка на графоанализ.\n' +
                '3. Логика графологического анализа.\n' +
                '4. Гештальт-подход',
            price: 0,
            skills: {
                'Оценка сотрудников': 3
            },
            requirements: {
                'Оценка сотрудников': 2,
            }
        },
        {
            id: 31,
            platform: 'YouTube',
            title: 'Подбор персонала: современные приемы проведения собеседования',
            url: 'https://www.youtube.com/watch?v=88dvOWrwEec',
            format: 'Видео',
            hasTeacher: false,
            hasPractice: false,
            certificate: 'Нет',
            city: '-',
            duration: 100,
            durationUnits: 'минута',
            description: 'обеседование - один из важнейших этапов подбора персонала (см. http://www.specialist.ru/course/kadr-... ), а владение современными приемами проведения собеседования позволяет специалисту по кадрам успешно достигать поставленных задач! \n' +
                'На вебинаре будут освещены следующие проблемы проведения собеседования и подбора персонала:\n' +
                '1. Выбор оптимальной технологии подбора (рекрутинг, эксклюзивный поиск, хэдхантинг, прелиминаринг).\n' +
                '2. Деловая беседа. Телефонное интервью, методики, применяемые в ходе интервью. \n' +
                '3. Стили, виды и типы интервью с соискателем.\n' +
                '4. Выбор и использование оптимальных методов первичной оценки кандидата: различные виды тестирования, учет параметров метапрограмм и др. \n' +
                '5. Оценка эффективности подбора персонала.\n' +
                '\n' +
                'Вебинар проводит один из лучших преподавателей Центра компьютерного обучения «Специалист» при МГТУ им. Н.Э. Баумана Иванова Татьяна Борисовна.\n',
            price: 0,
            skills: {
                'Проведение собеседований': 1
            },
            requirements: {}
        },
        {
            id: 32,
            platform: 'YouTube',
            title: 'Трудовые книжки: особенности ведения',
            url: 'https://www.youtube.com/watch?v=G1uc3dX0ChE',
            format: 'Видео',
            hasTeacher: false,
            hasPractice: false,
            certificate: 'Нет',
            city: '-',
            duration: 115,
            durationUnits: 'минута',
            description: 'Трудовая книжка является основным документом, подтверждающим трудовую деятельность и стаж работника. На основе записей в трудовой книжке происходит назначение государственных пенсий, пособий по социальному страхованию, вознаграждений за выслугу лет и т.д. На бесплатном семинаре учебного центра "Специалист" вы познакомитесь с особенностями учета, ведения и хранения трудовых книжек.\n' +
                '\n' +
                'На мастер-классе будут рассмотрены следующие темы:\n' +
                '\n' +
                '- Как правильно заполнять и вносить изменения в трудовую книжку?\n' +
                '-  Как происходит учет трудовых книжек и вкладышей в них?\n' +
                '- Какие сведения обязательно должны присутствовать в трудовой книжке работника?\n' +
                '\n' +
                'Ведет бесплатный урок сертифицированный специалист в области кадрового менеджмента, член национального Союза кадровиков Алексей Станиславович Конашевич',
            price: 0,
            skills: {
                'Кадровый учет': 1
            },
            requirements: {}
        },
        {
            id: 33,
            platform: 'YouTube',
            title: 'Подбор персонала организации',
            url: 'https://www.youtube.com/watch?v=oLfCPaOiqAA',
            format: 'Видео',
            hasTeacher: false,
            hasPractice: false,
            certificate: 'Нет',
            city: '-',
            duration: 88,
            durationUnits: 'минута',
            description: 'Вы познакомитесь с организацией работы по подбору персонала в компании. Узнате об особенностях подбора эффективных кадров в условиях современного рынка труда и обсудите самые актуальные способы и технологии привлечения кандидатов. Рассмотрите современные методики и алгоритмы подбора персонала.\n' +
                '\n' +
                'Темы, рассматриваемые на мастер-классе :\n' +
                '\n' +
                '- Каковы особенности современного рынка труда?\n' +
                '- Как использовать внутренние и внешние источники привлечения кандидатов?\n' +
                '- Как выбрать наиболее эффективную технологию привлечения работников?\n' +
                '- Как составить хорошее рекламное объявление о вакансии?\n' +
                '- Какие существуют современные технологии подбора?\n' +
                '- Как правильно провести собеседование?\n' +
                '- Как дать правильную оценку кандидату?\n' +
                '\n' +
                'Ведет бесплатный урок талантливый практикующий преподаватель, член Национального союза кадровиков России, великолепный специалист в области HR, умеющий «с нуля» подбирать и организовывать эффективную команду сотрудников любого уровня Алексей Станиславович Конашевич',
            price: 0,
            skills: {
                'Оценка сотрудников': 1,
                'Проведение собеседований': 1,
                'Активный поиск сотрудников': 1,
                'Холодный поиск сотрудников': 1,
                'Оценка сотрудников': 1,
                'Проведение собеседований': 1
            },
            requirements: {}
        }
    ];
}

window.getCoursesList = getCoursesList;